espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** Copyright 2020 Espressif Systems (Shanghai) PTE LTD
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** RMT_CH0DATA_REG register
 *  The read and write  data register for CHANNEL0 by apb fifo access.
 */
#define RMT_CH0DATA_REG (DR_REG_RMT_BASE + 0x0)
/** RMT_CH0DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 0 via APB FIFO.
 */
#define RMT_CH0DATA    0xFFFFFFFF
#define RMT_CH0DATA_M  (RMT_CH0DATA_V << RMT_CH0DATA_S)
#define RMT_CH0DATA_V  0xFFFFFFFF
#define RMT_CH0DATA_S  0

/** RMT_CH1DATA_REG register
 *  The read and write  data register for CHANNEL1 by apb fifo access.
 */
#define RMT_CH1DATA_REG (DR_REG_RMT_BASE + 0x4)
/** RMT_CH1DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 1 via APB FIFO.
 */
#define RMT_CH1DATA    0xFFFFFFFF
#define RMT_CH1DATA_M  (RMT_CH1DATA_V << RMT_CH1DATA_S)
#define RMT_CH1DATA_V  0xFFFFFFFF
#define RMT_CH1DATA_S  0

/** RMT_CH2DATA_REG register
 *  The read and write  data register for CHANNEL2 by apb fifo access.
 */
#define RMT_CH2DATA_REG (DR_REG_RMT_BASE + 0x8)
/** RMT_CH2DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 2 via APB FIFO.
 */
#define RMT_CH2DATA    0xFFFFFFFF
#define RMT_CH2DATA_M  (RMT_CH2DATA_V << RMT_CH2DATA_S)
#define RMT_CH2DATA_V  0xFFFFFFFF
#define RMT_CH2DATA_S  0

/** RMT_CH3DATA_REG register
 *  The read and write  data register for CHANNEL3 by apb fifo access.
 */
#define RMT_CH3DATA_REG (DR_REG_RMT_BASE + 0xc)
/** RMT_CH3DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 3 via APB FIFO.
 */
#define RMT_CH3DATA    0xFFFFFFFF
#define RMT_CH3DATA_M  (RMT_CH3DATA_V << RMT_CH3DATA_S)
#define RMT_CH3DATA_V  0xFFFFFFFF
#define RMT_CH3DATA_S  0

/** RMT_CH4DATA_REG register
 *  The read and write  data register for CHANNEL$n by apb fifo access.
 */
#define RMT_CH4DATA_REG (DR_REG_RMT_BASE + 0x10)
/** RMT_CH4DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel $n via APB FIFO.
 */
#define RMT_CH4DATA    0xFFFFFFFF
#define RMT_CH4DATA_M  (RMT_CH4DATA_V << RMT_CH4DATA_S)
#define RMT_CH4DATA_V  0xFFFFFFFF
#define RMT_CH4DATA_S  0

/** RMT_CH5DATA_REG register
 *  The read and write  data register for CHANNEL$n by apb fifo access.
 */
#define RMT_CH5DATA_REG (DR_REG_RMT_BASE + 0x14)
/** RMT_CH5DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel $n via APB FIFO.
 */
#define RMT_CH5DATA    0xFFFFFFFF
#define RMT_CH5DATA_M  (RMT_CH5DATA_V << RMT_CH5DATA_S)
#define RMT_CH5DATA_V  0xFFFFFFFF
#define RMT_CH5DATA_S  0

/** RMT_CH6DATA_REG register
 *  The read and write  data register for CHANNEL$n by apb fifo access.
 */
#define RMT_CH6DATA_REG (DR_REG_RMT_BASE + 0x18)
/** RMT_CH6DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel $n via APB FIFO.
 */
#define RMT_CH6DATA    0xFFFFFFFF
#define RMT_CH6DATA_M  (RMT_CH6DATA_V << RMT_CH6DATA_S)
#define RMT_CH6DATA_V  0xFFFFFFFF
#define RMT_CH6DATA_S  0

/** RMT_CH7DATA_REG register
 *  The read and write  data register for CHANNEL$n by apb fifo access.
 */
#define RMT_CH7DATA_REG (DR_REG_RMT_BASE + 0x1c)
/** RMT_CH7DATA : RO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel $n via APB FIFO.
 */
#define RMT_CH7DATA    0xFFFFFFFF
#define RMT_CH7DATA_M  (RMT_CH7DATA_V << RMT_CH7DATA_S)
#define RMT_CH7DATA_V  0xFFFFFFFF
#define RMT_CH7DATA_S  0

/** RMT_CH0CONF0_REG register
 *  Channel 0 configure register 0
 */
#define RMT_CH0CONF0_REG (DR_REG_RMT_BASE + 0x20)
/** RMT_TX_START_0 : WT; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on CHANNEL0.
 */
#define RMT_TX_START_0    (BIT(0))
#define RMT_TX_START_0_M  (RMT_TX_START_0_V << RMT_TX_START_0_S)
#define RMT_TX_START_0_V  0x00000001
#define RMT_TX_START_0_S  0
/** RMT_MEM_RD_RST_0 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset read ram address for CHANNEL0 by accessing transmitter.
 */
#define RMT_MEM_RD_RST_0    (BIT(1))
#define RMT_MEM_RD_RST_0_M  (RMT_MEM_RD_RST_0_V << RMT_MEM_RD_RST_0_S)
#define RMT_MEM_RD_RST_0_V  0x00000001
#define RMT_MEM_RD_RST_0_S  1
/** RMT_APB_MEM_RST_0 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL0 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_0    (BIT(2))
#define RMT_APB_MEM_RST_0_M  (RMT_APB_MEM_RST_0_V << RMT_APB_MEM_RST_0_S)
#define RMT_APB_MEM_RST_0_V  0x00000001
#define RMT_APB_MEM_RST_0_S  2
/** RMT_TX_CONTI_MODE_0 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to restart transmission  from the first data to the last data in
 *  CHANNEL0.
 */
#define RMT_TX_CONTI_MODE_0    (BIT(3))
#define RMT_TX_CONTI_MODE_0_M  (RMT_TX_CONTI_MODE_0_V << RMT_TX_CONTI_MODE_0_S)
#define RMT_TX_CONTI_MODE_0_V  0x00000001
#define RMT_TX_CONTI_MODE_0_S  3
/** RMT_MEM_TX_WRAP_EN_0 : R/W; bitpos: [4]; default: 0;
 *  This is the channel 0 enable bit for wraparound mode: it will resume sending at the
 *  start when the data to be sent is more than its memory size.
 */
#define RMT_MEM_TX_WRAP_EN_0    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_0_M  (RMT_MEM_TX_WRAP_EN_0_V << RMT_MEM_TX_WRAP_EN_0_S)
#define RMT_MEM_TX_WRAP_EN_0_V  0x00000001
#define RMT_MEM_TX_WRAP_EN_0_S  4
/** RMT_IDLE_OUT_LV_0 : R/W; bitpos: [5]; default: 0;
 *  This bit configures the level of output signal in CHANNEL0 when the latter is in
 *  IDLE state.
 */
#define RMT_IDLE_OUT_LV_0    (BIT(5))
#define RMT_IDLE_OUT_LV_0_M  (RMT_IDLE_OUT_LV_0_V << RMT_IDLE_OUT_LV_0_S)
#define RMT_IDLE_OUT_LV_0_V  0x00000001
#define RMT_IDLE_OUT_LV_0_S  5
/** RMT_IDLE_OUT_EN_0 : R/W; bitpos: [6]; default: 0;
 *  This is the output enable-control bit for CHANNEL0 in IDLE state.
 */
#define RMT_IDLE_OUT_EN_0    (BIT(6))
#define RMT_IDLE_OUT_EN_0_M  (RMT_IDLE_OUT_EN_0_V << RMT_IDLE_OUT_EN_0_S)
#define RMT_IDLE_OUT_EN_0_V  0x00000001
#define RMT_IDLE_OUT_EN_0_S  6
/** RMT_TX_STOP_0 : R/W/SC; bitpos: [7]; default: 0;
 *  Set this bit to stop the transmitter of CHANNEL0 sending data out.
 */
#define RMT_TX_STOP_0    (BIT(7))
#define RMT_TX_STOP_0_M  (RMT_TX_STOP_0_V << RMT_TX_STOP_0_S)
#define RMT_TX_STOP_0_V  0x00000001
#define RMT_TX_STOP_0_S  7
/** RMT_DIV_CNT_0 : R/W; bitpos: [15:8]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL0.
 */
#define RMT_DIV_CNT_0    0x000000FF
#define RMT_DIV_CNT_0_M  (RMT_DIV_CNT_0_V << RMT_DIV_CNT_0_S)
#define RMT_DIV_CNT_0_V  0x000000FF
#define RMT_DIV_CNT_0_S  8
/** RMT_MEM_SIZE_0 : R/W; bitpos: [19:16]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL0.
 */
#define RMT_MEM_SIZE_0    0x0000000F
#define RMT_MEM_SIZE_0_M  (RMT_MEM_SIZE_0_V << RMT_MEM_SIZE_0_S)
#define RMT_MEM_SIZE_0_V  0x0000000F
#define RMT_MEM_SIZE_0_S  16
/** RMT_CARRIER_EFF_EN_0 : R/W; bitpos: [20]; default: 1;
 *  1: Add carrier modulation on the output signal only at the send data state for
 *  CHANNEL0. 0: Add carrier modulation on the output signal at all state for CHANNEL0.
 *  Only valid when RMT_CARRIER_EN_CH0 is 1.
 */
#define RMT_CARRIER_EFF_EN_0    (BIT(20))
#define RMT_CARRIER_EFF_EN_0_M  (RMT_CARRIER_EFF_EN_0_V << RMT_CARRIER_EFF_EN_0_S)
#define RMT_CARRIER_EFF_EN_0_V  0x00000001
#define RMT_CARRIER_EFF_EN_0_S  20
/** RMT_CARRIER_EN_0 : R/W; bitpos: [21]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL0. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_0    (BIT(21))
#define RMT_CARRIER_EN_0_M  (RMT_CARRIER_EN_0_V << RMT_CARRIER_EN_0_S)
#define RMT_CARRIER_EN_0_V  0x00000001
#define RMT_CARRIER_EN_0_S  21
/** RMT_CARRIER_OUT_LV_0 : R/W; bitpos: [22]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL0.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_0    (BIT(22))
#define RMT_CARRIER_OUT_LV_0_M  (RMT_CARRIER_OUT_LV_0_V << RMT_CARRIER_OUT_LV_0_S)
#define RMT_CARRIER_OUT_LV_0_V  0x00000001
#define RMT_CARRIER_OUT_LV_0_S  22
/** RMT_AFIFO_RST_0 : WT; bitpos: [23]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_0    (BIT(23))
#define RMT_AFIFO_RST_0_M  (RMT_AFIFO_RST_0_V << RMT_AFIFO_RST_0_S)
#define RMT_AFIFO_RST_0_V  0x00000001
#define RMT_AFIFO_RST_0_S  23
/** RMT_CONF_UPDATE_0 : WT; bitpos: [24]; default: 0;
 *  synchronization bit for CHANNEL0
 */
#define RMT_CONF_UPDATE_0    (BIT(24))
#define RMT_CONF_UPDATE_0_M  (RMT_CONF_UPDATE_0_V << RMT_CONF_UPDATE_0_S)
#define RMT_CONF_UPDATE_0_V  0x00000001
#define RMT_CONF_UPDATE_0_S  24

/** RMT_CH1CONF0_REG register
 *  Channel 1 configure register 0
 */
#define RMT_CH1CONF0_REG (DR_REG_RMT_BASE + 0x24)
/** RMT_TX_START_1 : WT; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on CHANNEL1.
 */
#define RMT_TX_START_1    (BIT(0))
#define RMT_TX_START_1_M  (RMT_TX_START_1_V << RMT_TX_START_1_S)
#define RMT_TX_START_1_V  0x00000001
#define RMT_TX_START_1_S  0
/** RMT_MEM_RD_RST_1 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset read ram address for CHANNEL1 by accessing transmitter.
 */
#define RMT_MEM_RD_RST_1    (BIT(1))
#define RMT_MEM_RD_RST_1_M  (RMT_MEM_RD_RST_1_V << RMT_MEM_RD_RST_1_S)
#define RMT_MEM_RD_RST_1_V  0x00000001
#define RMT_MEM_RD_RST_1_S  1
/** RMT_APB_MEM_RST_1 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL1 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_1    (BIT(2))
#define RMT_APB_MEM_RST_1_M  (RMT_APB_MEM_RST_1_V << RMT_APB_MEM_RST_1_S)
#define RMT_APB_MEM_RST_1_V  0x00000001
#define RMT_APB_MEM_RST_1_S  2
/** RMT_TX_CONTI_MODE_1 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to restart transmission  from the first data to the last data in
 *  CHANNEL1.
 */
#define RMT_TX_CONTI_MODE_1    (BIT(3))
#define RMT_TX_CONTI_MODE_1_M  (RMT_TX_CONTI_MODE_1_V << RMT_TX_CONTI_MODE_1_S)
#define RMT_TX_CONTI_MODE_1_V  0x00000001
#define RMT_TX_CONTI_MODE_1_S  3
/** RMT_MEM_TX_WRAP_EN_1 : R/W; bitpos: [4]; default: 0;
 *  This is the channel 1 enable bit for wraparound mode: it will resume sending at the
 *  start when the data to be sent is more than its memory size.
 */
#define RMT_MEM_TX_WRAP_EN_1    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_1_M  (RMT_MEM_TX_WRAP_EN_1_V << RMT_MEM_TX_WRAP_EN_1_S)
#define RMT_MEM_TX_WRAP_EN_1_V  0x00000001
#define RMT_MEM_TX_WRAP_EN_1_S  4
/** RMT_IDLE_OUT_LV_1 : R/W; bitpos: [5]; default: 0;
 *  This bit configures the level of output signal in CHANNEL1 when the latter is in
 *  IDLE state.
 */
#define RMT_IDLE_OUT_LV_1    (BIT(5))
#define RMT_IDLE_OUT_LV_1_M  (RMT_IDLE_OUT_LV_1_V << RMT_IDLE_OUT_LV_1_S)
#define RMT_IDLE_OUT_LV_1_V  0x00000001
#define RMT_IDLE_OUT_LV_1_S  5
/** RMT_IDLE_OUT_EN_1 : R/W; bitpos: [6]; default: 0;
 *  This is the output enable-control bit for CHANNEL1 in IDLE state.
 */
#define RMT_IDLE_OUT_EN_1    (BIT(6))
#define RMT_IDLE_OUT_EN_1_M  (RMT_IDLE_OUT_EN_1_V << RMT_IDLE_OUT_EN_1_S)
#define RMT_IDLE_OUT_EN_1_V  0x00000001
#define RMT_IDLE_OUT_EN_1_S  6
/** RMT_TX_STOP_1 : R/W/SC; bitpos: [7]; default: 0;
 *  Set this bit to stop the transmitter of CHANNEL1 sending data out.
 */
#define RMT_TX_STOP_1    (BIT(7))
#define RMT_TX_STOP_1_M  (RMT_TX_STOP_1_V << RMT_TX_STOP_1_S)
#define RMT_TX_STOP_1_V  0x00000001
#define RMT_TX_STOP_1_S  7
/** RMT_DIV_CNT_1 : R/W; bitpos: [15:8]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL1.
 */
#define RMT_DIV_CNT_1    0x000000FF
#define RMT_DIV_CNT_1_M  (RMT_DIV_CNT_1_V << RMT_DIV_CNT_1_S)
#define RMT_DIV_CNT_1_V  0x000000FF
#define RMT_DIV_CNT_1_S  8
/** RMT_MEM_SIZE_1 : R/W; bitpos: [19:16]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL1.
 */
#define RMT_MEM_SIZE_1    0x0000000F
#define RMT_MEM_SIZE_1_M  (RMT_MEM_SIZE_1_V << RMT_MEM_SIZE_1_S)
#define RMT_MEM_SIZE_1_V  0x0000000F
#define RMT_MEM_SIZE_1_S  16
/** RMT_CARRIER_EFF_EN_1 : R/W; bitpos: [20]; default: 1;
 *  1: Add carrier modulation on the output signal only at the send data state for
 *  CHANNEL1. 0: Add carrier modulation on the output signal at all state for CHANNEL1.
 *  Only valid when RMT_CARRIER_EN_CH1 is 1.
 */
#define RMT_CARRIER_EFF_EN_1    (BIT(20))
#define RMT_CARRIER_EFF_EN_1_M  (RMT_CARRIER_EFF_EN_1_V << RMT_CARRIER_EFF_EN_1_S)
#define RMT_CARRIER_EFF_EN_1_V  0x00000001
#define RMT_CARRIER_EFF_EN_1_S  20
/** RMT_CARRIER_EN_1 : R/W; bitpos: [21]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL1. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_1    (BIT(21))
#define RMT_CARRIER_EN_1_M  (RMT_CARRIER_EN_1_V << RMT_CARRIER_EN_1_S)
#define RMT_CARRIER_EN_1_V  0x00000001
#define RMT_CARRIER_EN_1_S  21
/** RMT_CARRIER_OUT_LV_1 : R/W; bitpos: [22]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL1.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_1    (BIT(22))
#define RMT_CARRIER_OUT_LV_1_M  (RMT_CARRIER_OUT_LV_1_V << RMT_CARRIER_OUT_LV_1_S)
#define RMT_CARRIER_OUT_LV_1_V  0x00000001
#define RMT_CARRIER_OUT_LV_1_S  22
/** RMT_AFIFO_RST_1 : WT; bitpos: [23]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_1    (BIT(23))
#define RMT_AFIFO_RST_1_M  (RMT_AFIFO_RST_1_V << RMT_AFIFO_RST_1_S)
#define RMT_AFIFO_RST_1_V  0x00000001
#define RMT_AFIFO_RST_1_S  23
/** RMT_CONF_UPDATE_1 : WT; bitpos: [24]; default: 0;
 *  synchronization bit for CHANNEL1
 */
#define RMT_CONF_UPDATE_1    (BIT(24))
#define RMT_CONF_UPDATE_1_M  (RMT_CONF_UPDATE_1_V << RMT_CONF_UPDATE_1_S)
#define RMT_CONF_UPDATE_1_V  0x00000001
#define RMT_CONF_UPDATE_1_S  24

/** RMT_CH2CONF0_REG register
 *  Channel 2 configure register 0
 */
#define RMT_CH2CONF0_REG (DR_REG_RMT_BASE + 0x28)
/** RMT_TX_START_2 : WT; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on CHANNEL2.
 */
#define RMT_TX_START_2    (BIT(0))
#define RMT_TX_START_2_M  (RMT_TX_START_2_V << RMT_TX_START_2_S)
#define RMT_TX_START_2_V  0x00000001
#define RMT_TX_START_2_S  0
/** RMT_MEM_RD_RST_2 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset read ram address for CHANNEL2 by accessing transmitter.
 */
#define RMT_MEM_RD_RST_2    (BIT(1))
#define RMT_MEM_RD_RST_2_M  (RMT_MEM_RD_RST_2_V << RMT_MEM_RD_RST_2_S)
#define RMT_MEM_RD_RST_2_V  0x00000001
#define RMT_MEM_RD_RST_2_S  1
/** RMT_APB_MEM_RST_2 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL2 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_2    (BIT(2))
#define RMT_APB_MEM_RST_2_M  (RMT_APB_MEM_RST_2_V << RMT_APB_MEM_RST_2_S)
#define RMT_APB_MEM_RST_2_V  0x00000001
#define RMT_APB_MEM_RST_2_S  2
/** RMT_TX_CONTI_MODE_2 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to restart transmission  from the first data to the last data in
 *  CHANNEL2.
 */
#define RMT_TX_CONTI_MODE_2    (BIT(3))
#define RMT_TX_CONTI_MODE_2_M  (RMT_TX_CONTI_MODE_2_V << RMT_TX_CONTI_MODE_2_S)
#define RMT_TX_CONTI_MODE_2_V  0x00000001
#define RMT_TX_CONTI_MODE_2_S  3
/** RMT_MEM_TX_WRAP_EN_2 : R/W; bitpos: [4]; default: 0;
 *  This is the channel 2 enable bit for wraparound mode: it will resume sending at the
 *  start when the data to be sent is more than its memory size.
 */
#define RMT_MEM_TX_WRAP_EN_2    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_2_M  (RMT_MEM_TX_WRAP_EN_2_V << RMT_MEM_TX_WRAP_EN_2_S)
#define RMT_MEM_TX_WRAP_EN_2_V  0x00000001
#define RMT_MEM_TX_WRAP_EN_2_S  4
/** RMT_IDLE_OUT_LV_2 : R/W; bitpos: [5]; default: 0;
 *  This bit configures the level of output signal in CHANNEL2 when the latter is in
 *  IDLE state.
 */
#define RMT_IDLE_OUT_LV_2    (BIT(5))
#define RMT_IDLE_OUT_LV_2_M  (RMT_IDLE_OUT_LV_2_V << RMT_IDLE_OUT_LV_2_S)
#define RMT_IDLE_OUT_LV_2_V  0x00000001
#define RMT_IDLE_OUT_LV_2_S  5
/** RMT_IDLE_OUT_EN_2 : R/W; bitpos: [6]; default: 0;
 *  This is the output enable-control bit for CHANNEL2 in IDLE state.
 */
#define RMT_IDLE_OUT_EN_2    (BIT(6))
#define RMT_IDLE_OUT_EN_2_M  (RMT_IDLE_OUT_EN_2_V << RMT_IDLE_OUT_EN_2_S)
#define RMT_IDLE_OUT_EN_2_V  0x00000001
#define RMT_IDLE_OUT_EN_2_S  6
/** RMT_TX_STOP_2 : R/W/SC; bitpos: [7]; default: 0;
 *  Set this bit to stop the transmitter of CHANNEL2 sending data out.
 */
#define RMT_TX_STOP_2    (BIT(7))
#define RMT_TX_STOP_2_M  (RMT_TX_STOP_2_V << RMT_TX_STOP_2_S)
#define RMT_TX_STOP_2_V  0x00000001
#define RMT_TX_STOP_2_S  7
/** RMT_DIV_CNT_2 : R/W; bitpos: [15:8]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL2.
 */
#define RMT_DIV_CNT_2    0x000000FF
#define RMT_DIV_CNT_2_M  (RMT_DIV_CNT_2_V << RMT_DIV_CNT_2_S)
#define RMT_DIV_CNT_2_V  0x000000FF
#define RMT_DIV_CNT_2_S  8
/** RMT_MEM_SIZE_2 : R/W; bitpos: [19:16]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL2.
 */
#define RMT_MEM_SIZE_2    0x0000000F
#define RMT_MEM_SIZE_2_M  (RMT_MEM_SIZE_2_V << RMT_MEM_SIZE_2_S)
#define RMT_MEM_SIZE_2_V  0x0000000F
#define RMT_MEM_SIZE_2_S  16
/** RMT_CARRIER_EFF_EN_2 : R/W; bitpos: [20]; default: 1;
 *  1: Add carrier modulation on the output signal only at the send data state for
 *  CHANNEL2. 0: Add carrier modulation on the output signal at all state for CHANNEL2.
 *  Only valid when RMT_CARRIER_EN_CH2 is 1.
 */
#define RMT_CARRIER_EFF_EN_2    (BIT(20))
#define RMT_CARRIER_EFF_EN_2_M  (RMT_CARRIER_EFF_EN_2_V << RMT_CARRIER_EFF_EN_2_S)
#define RMT_CARRIER_EFF_EN_2_V  0x00000001
#define RMT_CARRIER_EFF_EN_2_S  20
/** RMT_CARRIER_EN_2 : R/W; bitpos: [21]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL2. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_2    (BIT(21))
#define RMT_CARRIER_EN_2_M  (RMT_CARRIER_EN_2_V << RMT_CARRIER_EN_2_S)
#define RMT_CARRIER_EN_2_V  0x00000001
#define RMT_CARRIER_EN_2_S  21
/** RMT_CARRIER_OUT_LV_2 : R/W; bitpos: [22]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL2.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_2    (BIT(22))
#define RMT_CARRIER_OUT_LV_2_M  (RMT_CARRIER_OUT_LV_2_V << RMT_CARRIER_OUT_LV_2_S)
#define RMT_CARRIER_OUT_LV_2_V  0x00000001
#define RMT_CARRIER_OUT_LV_2_S  22
/** RMT_AFIFO_RST_2 : WT; bitpos: [23]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_2    (BIT(23))
#define RMT_AFIFO_RST_2_M  (RMT_AFIFO_RST_2_V << RMT_AFIFO_RST_2_S)
#define RMT_AFIFO_RST_2_V  0x00000001
#define RMT_AFIFO_RST_2_S  23
/** RMT_CONF_UPDATE_2 : WT; bitpos: [24]; default: 0;
 *  synchronization bit for CHANNEL2
 */
#define RMT_CONF_UPDATE_2    (BIT(24))
#define RMT_CONF_UPDATE_2_M  (RMT_CONF_UPDATE_2_V << RMT_CONF_UPDATE_2_S)
#define RMT_CONF_UPDATE_2_V  0x00000001
#define RMT_CONF_UPDATE_2_S  24

