espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_CH3CONF0_REG register
 *  Channel 3 configure register 0
 */
#define RMT_CH3CONF0_REG (DR_REG_RMT_BASE + 0x2c)
/** RMT_TX_START_3 : WT; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on CHANNEL3.
 */
#define RMT_TX_START_3    (BIT(0))
#define RMT_TX_START_3_M  (RMT_TX_START_3_V << RMT_TX_START_3_S)
#define RMT_TX_START_3_V  0x00000001
#define RMT_TX_START_3_S  0
/** RMT_MEM_RD_RST_3 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset read ram address for CHANNEL3 by accessing transmitter.
 */
#define RMT_MEM_RD_RST_3    (BIT(1))
#define RMT_MEM_RD_RST_3_M  (RMT_MEM_RD_RST_3_V << RMT_MEM_RD_RST_3_S)
#define RMT_MEM_RD_RST_3_V  0x00000001
#define RMT_MEM_RD_RST_3_S  1
/** RMT_APB_MEM_RST_3 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL3 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_3    (BIT(2))
#define RMT_APB_MEM_RST_3_M  (RMT_APB_MEM_RST_3_V << RMT_APB_MEM_RST_3_S)
#define RMT_APB_MEM_RST_3_V  0x00000001
#define RMT_APB_MEM_RST_3_S  2
/** RMT_TX_CONTI_MODE_3 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to restart transmission  from the first data to the last data in
 *  CHANNEL3.
 */
#define RMT_TX_CONTI_MODE_3    (BIT(3))
#define RMT_TX_CONTI_MODE_3_M  (RMT_TX_CONTI_MODE_3_V << RMT_TX_CONTI_MODE_3_S)
#define RMT_TX_CONTI_MODE_3_V  0x00000001
#define RMT_TX_CONTI_MODE_3_S  3
/** RMT_MEM_TX_WRAP_EN_3 : R/W; bitpos: [4]; default: 0;
 *  This is the channel 3 enable bit for wraparound mode: it will resume sending at the
 *  start when the data to be sent is more than its memory size.
 */
#define RMT_MEM_TX_WRAP_EN_3    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_3_M  (RMT_MEM_TX_WRAP_EN_3_V << RMT_MEM_TX_WRAP_EN_3_S)
#define RMT_MEM_TX_WRAP_EN_3_V  0x00000001
#define RMT_MEM_TX_WRAP_EN_3_S  4
/** RMT_IDLE_OUT_LV_3 : R/W; bitpos: [5]; default: 0;
 *  This bit configures the level of output signal in CHANNEL3 when the latter is in
 *  IDLE state.
 */
#define RMT_IDLE_OUT_LV_3    (BIT(5))
#define RMT_IDLE_OUT_LV_3_M  (RMT_IDLE_OUT_LV_3_V << RMT_IDLE_OUT_LV_3_S)
#define RMT_IDLE_OUT_LV_3_V  0x00000001
#define RMT_IDLE_OUT_LV_3_S  5
/** RMT_IDLE_OUT_EN_3 : R/W; bitpos: [6]; default: 0;
 *  This is the output enable-control bit for CHANNEL3 in IDLE state.
 */
#define RMT_IDLE_OUT_EN_3    (BIT(6))
#define RMT_IDLE_OUT_EN_3_M  (RMT_IDLE_OUT_EN_3_V << RMT_IDLE_OUT_EN_3_S)
#define RMT_IDLE_OUT_EN_3_V  0x00000001
#define RMT_IDLE_OUT_EN_3_S  6
/** RMT_TX_STOP_3 : R/W/SC; bitpos: [7]; default: 0;
 *  Set this bit to stop the transmitter of CHANNEL3 sending data out.
 */
#define RMT_TX_STOP_3    (BIT(7))
#define RMT_TX_STOP_3_M  (RMT_TX_STOP_3_V << RMT_TX_STOP_3_S)
#define RMT_TX_STOP_3_V  0x00000001
#define RMT_TX_STOP_3_S  7
/** RMT_DIV_CNT_3 : R/W; bitpos: [15:8]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL3.
 */
#define RMT_DIV_CNT_3    0x000000FF
#define RMT_DIV_CNT_3_M  (RMT_DIV_CNT_3_V << RMT_DIV_CNT_3_S)
#define RMT_DIV_CNT_3_V  0x000000FF
#define RMT_DIV_CNT_3_S  8
/** RMT_MEM_SIZE_3 : R/W; bitpos: [19:16]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL3.
 */
#define RMT_MEM_SIZE_3    0x0000000F
#define RMT_MEM_SIZE_3_M  (RMT_MEM_SIZE_3_V << RMT_MEM_SIZE_3_S)
#define RMT_MEM_SIZE_3_V  0x0000000F
#define RMT_MEM_SIZE_3_S  16
/** RMT_CARRIER_EFF_EN_3 : R/W; bitpos: [20]; default: 1;
 *  1: Add carrier modulation on the output signal only at the send data state for
 *  CHANNEL3. 0: Add carrier modulation on the output signal at all state for CHANNEL3.
 *  Only valid when RMT_CARRIER_EN_CH3 is 1.
 */
#define RMT_CARRIER_EFF_EN_3    (BIT(20))
#define RMT_CARRIER_EFF_EN_3_M  (RMT_CARRIER_EFF_EN_3_V << RMT_CARRIER_EFF_EN_3_S)
#define RMT_CARRIER_EFF_EN_3_V  0x00000001
#define RMT_CARRIER_EFF_EN_3_S  20
/** RMT_CARRIER_EN_3 : R/W; bitpos: [21]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL3. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_3    (BIT(21))
#define RMT_CARRIER_EN_3_M  (RMT_CARRIER_EN_3_V << RMT_CARRIER_EN_3_S)
#define RMT_CARRIER_EN_3_V  0x00000001
#define RMT_CARRIER_EN_3_S  21
/** RMT_CARRIER_OUT_LV_3 : R/W; bitpos: [22]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL3.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_3    (BIT(22))
#define RMT_CARRIER_OUT_LV_3_M  (RMT_CARRIER_OUT_LV_3_V << RMT_CARRIER_OUT_LV_3_S)
#define RMT_CARRIER_OUT_LV_3_V  0x00000001
#define RMT_CARRIER_OUT_LV_3_S  22
/** RMT_AFIFO_RST_3 : WT; bitpos: [23]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_3    (BIT(23))
#define RMT_AFIFO_RST_3_M  (RMT_AFIFO_RST_3_V << RMT_AFIFO_RST_3_S)
#define RMT_AFIFO_RST_3_V  0x00000001
#define RMT_AFIFO_RST_3_S  23
/** RMT_CONF_UPDATE_3 : WT; bitpos: [24]; default: 0;
 *  synchronization bit for CHANNEL3
 */
#define RMT_CONF_UPDATE_3    (BIT(24))
#define RMT_CONF_UPDATE_3_M  (RMT_CONF_UPDATE_3_V << RMT_CONF_UPDATE_3_S)
#define RMT_CONF_UPDATE_3_V  0x00000001
#define RMT_CONF_UPDATE_3_S  24

/** RMT_CH4CONF0_REG register
 *  Channel 4 configure register 0
 */
#define RMT_CH4CONF0_REG (DR_REG_RMT_BASE + 0x30)
/** RMT_DIV_CNT_4 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL4.
 */
#define RMT_DIV_CNT_4    0x000000FF
#define RMT_DIV_CNT_4_M  (RMT_DIV_CNT_4_V << RMT_DIV_CNT_4_S)
#define RMT_DIV_CNT_4_V  0x000000FF
#define RMT_DIV_CNT_4_S  0
/** RMT_IDLE_THRES_4 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_4    0x00007FFF
#define RMT_IDLE_THRES_4_M  (RMT_IDLE_THRES_4_V << RMT_IDLE_THRES_4_S)
#define RMT_IDLE_THRES_4_V  0x00007FFF
#define RMT_IDLE_THRES_4_S  8
/** RMT_MEM_SIZE_4 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL4.
 */
#define RMT_MEM_SIZE_4    0x0000000F
#define RMT_MEM_SIZE_4_M  (RMT_MEM_SIZE_4_V << RMT_MEM_SIZE_4_S)
#define RMT_MEM_SIZE_4_V  0x0000000F
#define RMT_MEM_SIZE_4_S  24
/** RMT_CARRIER_EN_4 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL4. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_4    (BIT(28))
#define RMT_CARRIER_EN_4_M  (RMT_CARRIER_EN_4_V << RMT_CARRIER_EN_4_S)
#define RMT_CARRIER_EN_4_V  0x00000001
#define RMT_CARRIER_EN_4_S  28
/** RMT_CARRIER_OUT_LV_4 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL4.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_4    (BIT(29))
#define RMT_CARRIER_OUT_LV_4_M  (RMT_CARRIER_OUT_LV_4_V << RMT_CARRIER_OUT_LV_4_S)
#define RMT_CARRIER_OUT_LV_4_V  0x00000001
#define RMT_CARRIER_OUT_LV_4_S  29

/** RMT_CH4CONF1_REG register
 *  Channel 4 configure register 1
 */
#define RMT_CH4CONF1_REG (DR_REG_RMT_BASE + 0x34)
/** RMT_RX_EN_4 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL4.
 */
#define RMT_RX_EN_4    (BIT(0))
#define RMT_RX_EN_4_M  (RMT_RX_EN_4_V << RMT_RX_EN_4_S)
#define RMT_RX_EN_4_V  0x00000001
#define RMT_RX_EN_4_S  0
/** RMT_MEM_WR_RST_4 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL4 by accessing receiver.
 */
#define RMT_MEM_WR_RST_4    (BIT(1))
#define RMT_MEM_WR_RST_4_M  (RMT_MEM_WR_RST_4_V << RMT_MEM_WR_RST_4_S)
#define RMT_MEM_WR_RST_4_V  0x00000001
#define RMT_MEM_WR_RST_4_S  1
/** RMT_APB_MEM_RST_4 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL4 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_4    (BIT(2))
#define RMT_APB_MEM_RST_4_M  (RMT_APB_MEM_RST_4_V << RMT_APB_MEM_RST_4_S)
#define RMT_APB_MEM_RST_4_V  0x00000001
#define RMT_APB_MEM_RST_4_S  2
/** RMT_MEM_OWNER_4 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL4's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_4    (BIT(3))
#define RMT_MEM_OWNER_4_M  (RMT_MEM_OWNER_4_V << RMT_MEM_OWNER_4_S)
#define RMT_MEM_OWNER_4_V  0x00000001
#define RMT_MEM_OWNER_4_S  3
/** RMT_RX_FILTER_EN_4 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL4.
 */
#define RMT_RX_FILTER_EN_4    (BIT(4))
#define RMT_RX_FILTER_EN_4_M  (RMT_RX_FILTER_EN_4_V << RMT_RX_FILTER_EN_4_S)
#define RMT_RX_FILTER_EN_4_V  0x00000001
#define RMT_RX_FILTER_EN_4_S  4
/** RMT_RX_FILTER_THRES_4 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_4    0x000000FF
#define RMT_RX_FILTER_THRES_4_M  (RMT_RX_FILTER_THRES_4_V << RMT_RX_FILTER_THRES_4_S)
#define RMT_RX_FILTER_THRES_4_V  0x000000FF
#define RMT_RX_FILTER_THRES_4_S  5
/** RMT_MEM_RX_WRAP_EN_4 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 4 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_4    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_4_M  (RMT_MEM_RX_WRAP_EN_4_V << RMT_MEM_RX_WRAP_EN_4_S)
#define RMT_MEM_RX_WRAP_EN_4_V  0x00000001
#define RMT_MEM_RX_WRAP_EN_4_S  13
/** RMT_AFIFO_RST_4 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_4    (BIT(14))
#define RMT_AFIFO_RST_4_M  (RMT_AFIFO_RST_4_V << RMT_AFIFO_RST_4_S)
#define RMT_AFIFO_RST_4_V  0x00000001
#define RMT_AFIFO_RST_4_S  14
/** RMT_CONF_UPDATE_4 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL4
 */
#define RMT_CONF_UPDATE_4    (BIT(15))
#define RMT_CONF_UPDATE_4_M  (RMT_CONF_UPDATE_4_V << RMT_CONF_UPDATE_4_S)
#define RMT_CONF_UPDATE_4_V  0x00000001
#define RMT_CONF_UPDATE_4_S  15

/** RMT_CH5CONF0_REG register
 *  Channel 5 configure register 0
 */
#define RMT_CH5CONF0_REG (DR_REG_RMT_BASE + 0x38)
/** RMT_DIV_CNT_5 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL5.
 */
#define RMT_DIV_CNT_5    0x000000FF
#define RMT_DIV_CNT_5_M  (RMT_DIV_CNT_5_V << RMT_DIV_CNT_5_S)
#define RMT_DIV_CNT_5_V  0x000000FF
#define RMT_DIV_CNT_5_S  0
/** RMT_IDLE_THRES_5 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_5    0x00007FFF
#define RMT_IDLE_THRES_5_M  (RMT_IDLE_THRES_5_V << RMT_IDLE_THRES_5_S)
#define RMT_IDLE_THRES_5_V  0x00007FFF
#define RMT_IDLE_THRES_5_S  8
/** RMT_MEM_SIZE_5 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL5.
 */
#define RMT_MEM_SIZE_5    0x0000000F
#define RMT_MEM_SIZE_5_M  (RMT_MEM_SIZE_5_V << RMT_MEM_SIZE_5_S)
#define RMT_MEM_SIZE_5_V  0x0000000F
#define RMT_MEM_SIZE_5_S  24
/** RMT_CARRIER_EN_5 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL5. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_5    (BIT(28))
#define RMT_CARRIER_EN_5_M  (RMT_CARRIER_EN_5_V << RMT_CARRIER_EN_5_S)
#define RMT_CARRIER_EN_5_V  0x00000001
#define RMT_CARRIER_EN_5_S  28
/** RMT_CARRIER_OUT_LV_5 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL5.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_5    (BIT(29))
#define RMT_CARRIER_OUT_LV_5_M  (RMT_CARRIER_OUT_LV_5_V << RMT_CARRIER_OUT_LV_5_S)
#define RMT_CARRIER_OUT_LV_5_V  0x00000001
#define RMT_CARRIER_OUT_LV_5_S  29

/** RMT_CH5CONF1_REG register
 *  Channel 5 configure register 1
 */
#define RMT_CH5CONF1_REG (DR_REG_RMT_BASE + 0x3c)
/** RMT_RX_EN_5 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL5.
 */
#define RMT_RX_EN_5    (BIT(0))
#define RMT_RX_EN_5_M  (RMT_RX_EN_5_V << RMT_RX_EN_5_S)
#define RMT_RX_EN_5_V  0x00000001
#define RMT_RX_EN_5_S  0
/** RMT_MEM_WR_RST_5 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL5 by accessing receiver.
 */
#define RMT_MEM_WR_RST_5    (BIT(1))
#define RMT_MEM_WR_RST_5_M  (RMT_MEM_WR_RST_5_V << RMT_MEM_WR_RST_5_S)
#define RMT_MEM_WR_RST_5_V  0x00000001
#define RMT_MEM_WR_RST_5_S  1
/** RMT_APB_MEM_RST_5 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL5 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_5    (BIT(2))
#define RMT_APB_MEM_RST_5_M  (RMT_APB_MEM_RST_5_V << RMT_APB_MEM_RST_5_S)
#define RMT_APB_MEM_RST_5_V  0x00000001
#define RMT_APB_MEM_RST_5_S  2
/** RMT_MEM_OWNER_5 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL5's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_5    (BIT(3))
#define RMT_MEM_OWNER_5_M  (RMT_MEM_OWNER_5_V << RMT_MEM_OWNER_5_S)
#define RMT_MEM_OWNER_5_V  0x00000001
#define RMT_MEM_OWNER_5_S  3
/** RMT_RX_FILTER_EN_5 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL5.
 */
#define RMT_RX_FILTER_EN_5    (BIT(4))
#define RMT_RX_FILTER_EN_5_M  (RMT_RX_FILTER_EN_5_V << RMT_RX_FILTER_EN_5_S)
#define RMT_RX_FILTER_EN_5_V  0x00000001
#define RMT_RX_FILTER_EN_5_S  4
/** RMT_RX_FILTER_THRES_5 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_5    0x000000FF
#define RMT_RX_FILTER_THRES_5_M  (RMT_RX_FILTER_THRES_5_V << RMT_RX_FILTER_THRES_5_S)
#define RMT_RX_FILTER_THRES_5_V  0x000000FF
#define RMT_RX_FILTER_THRES_5_S  5
/** RMT_MEM_RX_WRAP_EN_5 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 5 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_5    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_5_M  (RMT_MEM_RX_WRAP_EN_5_V << RMT_MEM_RX_WRAP_EN_5_S)
#define RMT_MEM_RX_WRAP_EN_5_V  0x00000001
#define RMT_MEM_RX_WRAP_EN_5_S  13
/** RMT_AFIFO_RST_5 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_5    (BIT(14))
#define RMT_AFIFO_RST_5_M  (RMT_AFIFO_RST_5_V << RMT_AFIFO_RST_5_S)
#define RMT_AFIFO_RST_5_V  0x00000001
#define RMT_AFIFO_RST_5_S  14
/** RMT_CONF_UPDATE_5 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL5
 */
#define RMT_CONF_UPDATE_5    (BIT(15))
#define RMT_CONF_UPDATE_5_M  (RMT_CONF_UPDATE_5_V << RMT_CONF_UPDATE_5_S)
#define RMT_CONF_UPDATE_5_V  0x00000001
#define RMT_CONF_UPDATE_5_S  15

