espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_CH6CONF0_REG register
 *  Channel 6 configure register 0
 */
#define RMT_CH6CONF0_REG (DR_REG_RMT_BASE + 0x40)
/** RMT_DIV_CNT_6 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL6.
 */
#define RMT_DIV_CNT_6    0x000000FF
#define RMT_DIV_CNT_6_M  (RMT_DIV_CNT_6_V << RMT_DIV_CNT_6_S)
#define RMT_DIV_CNT_6_V  0x000000FF
#define RMT_DIV_CNT_6_S  0
/** RMT_IDLE_THRES_6 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_6    0x00007FFF
#define RMT_IDLE_THRES_6_M  (RMT_IDLE_THRES_6_V << RMT_IDLE_THRES_6_S)
#define RMT_IDLE_THRES_6_V  0x00007FFF
#define RMT_IDLE_THRES_6_S  8
/** RMT_MEM_SIZE_6 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL6.
 */
#define RMT_MEM_SIZE_6    0x0000000F
#define RMT_MEM_SIZE_6_M  (RMT_MEM_SIZE_6_V << RMT_MEM_SIZE_6_S)
#define RMT_MEM_SIZE_6_V  0x0000000F
#define RMT_MEM_SIZE_6_S  24
/** RMT_CARRIER_EN_6 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL6. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_6    (BIT(28))
#define RMT_CARRIER_EN_6_M  (RMT_CARRIER_EN_6_V << RMT_CARRIER_EN_6_S)
#define RMT_CARRIER_EN_6_V  0x00000001
#define RMT_CARRIER_EN_6_S  28
/** RMT_CARRIER_OUT_LV_6 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL6.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_6    (BIT(29))
#define RMT_CARRIER_OUT_LV_6_M  (RMT_CARRIER_OUT_LV_6_V << RMT_CARRIER_OUT_LV_6_S)
#define RMT_CARRIER_OUT_LV_6_V  0x00000001
#define RMT_CARRIER_OUT_LV_6_S  29

/** RMT_CH6CONF1_REG register
 *  Channel 6 configure register 1
 */
#define RMT_CH6CONF1_REG (DR_REG_RMT_BASE + 0x44)
/** RMT_RX_EN_6 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL6.
 */
#define RMT_RX_EN_6    (BIT(0))
#define RMT_RX_EN_6_M  (RMT_RX_EN_6_V << RMT_RX_EN_6_S)
#define RMT_RX_EN_6_V  0x00000001
#define RMT_RX_EN_6_S  0
/** RMT_MEM_WR_RST_6 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL6 by accessing receiver.
 */
#define RMT_MEM_WR_RST_6    (BIT(1))
#define RMT_MEM_WR_RST_6_M  (RMT_MEM_WR_RST_6_V << RMT_MEM_WR_RST_6_S)
#define RMT_MEM_WR_RST_6_V  0x00000001
#define RMT_MEM_WR_RST_6_S  1
/** RMT_APB_MEM_RST_6 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL6 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_6    (BIT(2))
#define RMT_APB_MEM_RST_6_M  (RMT_APB_MEM_RST_6_V << RMT_APB_MEM_RST_6_S)
#define RMT_APB_MEM_RST_6_V  0x00000001
#define RMT_APB_MEM_RST_6_S  2
/** RMT_MEM_OWNER_6 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL6's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_6    (BIT(3))
#define RMT_MEM_OWNER_6_M  (RMT_MEM_OWNER_6_V << RMT_MEM_OWNER_6_S)
#define RMT_MEM_OWNER_6_V  0x00000001
#define RMT_MEM_OWNER_6_S  3
/** RMT_RX_FILTER_EN_6 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL6.
 */
#define RMT_RX_FILTER_EN_6    (BIT(4))
#define RMT_RX_FILTER_EN_6_M  (RMT_RX_FILTER_EN_6_V << RMT_RX_FILTER_EN_6_S)
#define RMT_RX_FILTER_EN_6_V  0x00000001
#define RMT_RX_FILTER_EN_6_S  4
/** RMT_RX_FILTER_THRES_6 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_6    0x000000FF
#define RMT_RX_FILTER_THRES_6_M  (RMT_RX_FILTER_THRES_6_V << RMT_RX_FILTER_THRES_6_S)
#define RMT_RX_FILTER_THRES_6_V  0x000000FF
#define RMT_RX_FILTER_THRES_6_S  5
/** RMT_MEM_RX_WRAP_EN_6 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 6 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_6    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_6_M  (RMT_MEM_RX_WRAP_EN_6_V << RMT_MEM_RX_WRAP_EN_6_S)
#define RMT_MEM_RX_WRAP_EN_6_V  0x00000001
#define RMT_MEM_RX_WRAP_EN_6_S  13
/** RMT_AFIFO_RST_6 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_6    (BIT(14))
#define RMT_AFIFO_RST_6_M  (RMT_AFIFO_RST_6_V << RMT_AFIFO_RST_6_S)
#define RMT_AFIFO_RST_6_V  0x00000001
#define RMT_AFIFO_RST_6_S  14
/** RMT_CONF_UPDATE_6 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL6
 */
#define RMT_CONF_UPDATE_6    (BIT(15))
#define RMT_CONF_UPDATE_6_M  (RMT_CONF_UPDATE_6_V << RMT_CONF_UPDATE_6_S)
#define RMT_CONF_UPDATE_6_V  0x00000001
#define RMT_CONF_UPDATE_6_S  15

/** RMT_CH7CONF0_REG register
 *  Channel 7 configure register 0
 */
#define RMT_CH7CONF0_REG (DR_REG_RMT_BASE + 0x48)
/** RMT_DIV_CNT_7 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL7.
 */
#define RMT_DIV_CNT_7    0x000000FF
#define RMT_DIV_CNT_7_M  (RMT_DIV_CNT_7_V << RMT_DIV_CNT_7_S)
#define RMT_DIV_CNT_7_V  0x000000FF
#define RMT_DIV_CNT_7_S  0
/** RMT_IDLE_THRES_7 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_7    0x00007FFF
#define RMT_IDLE_THRES_7_M  (RMT_IDLE_THRES_7_V << RMT_IDLE_THRES_7_S)
#define RMT_IDLE_THRES_7_V  0x00007FFF
#define RMT_IDLE_THRES_7_S  8
/** RMT_MEM_SIZE_7 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL7.
 */
#define RMT_MEM_SIZE_7    0x0000000F
#define RMT_MEM_SIZE_7_M  (RMT_MEM_SIZE_7_V << RMT_MEM_SIZE_7_S)
#define RMT_MEM_SIZE_7_V  0x0000000F
#define RMT_MEM_SIZE_7_S  24
/** RMT_CARRIER_EN_7 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL7. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_7    (BIT(28))
#define RMT_CARRIER_EN_7_M  (RMT_CARRIER_EN_7_V << RMT_CARRIER_EN_7_S)
#define RMT_CARRIER_EN_7_V  0x00000001
#define RMT_CARRIER_EN_7_S  28
/** RMT_CARRIER_OUT_LV_7 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL7.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_7    (BIT(29))
#define RMT_CARRIER_OUT_LV_7_M  (RMT_CARRIER_OUT_LV_7_V << RMT_CARRIER_OUT_LV_7_S)
#define RMT_CARRIER_OUT_LV_7_V  0x00000001
#define RMT_CARRIER_OUT_LV_7_S  29

/** RMT_CH7CONF1_REG register
 *  Channel 7 configure register 1
 */
#define RMT_CH7CONF1_REG (DR_REG_RMT_BASE + 0x4c)
/** RMT_RX_EN_7 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL7.
 */
#define RMT_RX_EN_7    (BIT(0))
#define RMT_RX_EN_7_M  (RMT_RX_EN_7_V << RMT_RX_EN_7_S)
#define RMT_RX_EN_7_V  0x00000001
#define RMT_RX_EN_7_S  0
/** RMT_MEM_WR_RST_7 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL7 by accessing receiver.
 */
#define RMT_MEM_WR_RST_7    (BIT(1))
#define RMT_MEM_WR_RST_7_M  (RMT_MEM_WR_RST_7_V << RMT_MEM_WR_RST_7_S)
#define RMT_MEM_WR_RST_7_V  0x00000001
#define RMT_MEM_WR_RST_7_S  1
/** RMT_APB_MEM_RST_7 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL7 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_7    (BIT(2))
#define RMT_APB_MEM_RST_7_M  (RMT_APB_MEM_RST_7_V << RMT_APB_MEM_RST_7_S)
#define RMT_APB_MEM_RST_7_V  0x00000001
#define RMT_APB_MEM_RST_7_S  2
/** RMT_MEM_OWNER_7 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL7's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_7    (BIT(3))
#define RMT_MEM_OWNER_7_M  (RMT_MEM_OWNER_7_V << RMT_MEM_OWNER_7_S)
#define RMT_MEM_OWNER_7_V  0x00000001
#define RMT_MEM_OWNER_7_S  3
/** RMT_RX_FILTER_EN_7 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL7.
 */
#define RMT_RX_FILTER_EN_7    (BIT(4))
#define RMT_RX_FILTER_EN_7_M  (RMT_RX_FILTER_EN_7_V << RMT_RX_FILTER_EN_7_S)
#define RMT_RX_FILTER_EN_7_V  0x00000001
#define RMT_RX_FILTER_EN_7_S  4
/** RMT_RX_FILTER_THRES_7 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_7    0x000000FF
#define RMT_RX_FILTER_THRES_7_M  (RMT_RX_FILTER_THRES_7_V << RMT_RX_FILTER_THRES_7_S)
#define RMT_RX_FILTER_THRES_7_V  0x000000FF
#define RMT_RX_FILTER_THRES_7_S  5
/** RMT_MEM_RX_WRAP_EN_7 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 7 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_7    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_7_M  (RMT_MEM_RX_WRAP_EN_7_V << RMT_MEM_RX_WRAP_EN_7_S)
#define RMT_MEM_RX_WRAP_EN_7_V  0x00000001
#define RMT_MEM_RX_WRAP_EN_7_S  13
/** RMT_AFIFO_RST_7 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_7    (BIT(14))
#define RMT_AFIFO_RST_7_M  (RMT_AFIFO_RST_7_V << RMT_AFIFO_RST_7_S)
#define RMT_AFIFO_RST_7_V  0x00000001
#define RMT_AFIFO_RST_7_S  14
/** RMT_CONF_UPDATE_7 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL7
 */
#define RMT_CONF_UPDATE_7    (BIT(15))
#define RMT_CONF_UPDATE_7_M  (RMT_CONF_UPDATE_7_V << RMT_CONF_UPDATE_7_S)
#define RMT_CONF_UPDATE_7_V  0x00000001
#define RMT_CONF_UPDATE_7_S  15

