espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_CH0STATUS_REG register
 *  Channel 0 status register
 */
#define RMT_CH0STATUS_REG (DR_REG_RMT_BASE + 0x50)
/** RMT_MEM_RADDR_EX_0 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL0 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_0    0x000003FF
#define RMT_MEM_RADDR_EX_0_M  (RMT_MEM_RADDR_EX_0_V << RMT_MEM_RADDR_EX_0_S)
#define RMT_MEM_RADDR_EX_0_V  0x000003FF
#define RMT_MEM_RADDR_EX_0_S  0
/** RMT_APB_MEM_WADDR_0 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_0    0x000003FF
#define RMT_APB_MEM_WADDR_0_M  (RMT_APB_MEM_WADDR_0_V << RMT_APB_MEM_WADDR_0_S)
#define RMT_APB_MEM_WADDR_0_V  0x000003FF
#define RMT_APB_MEM_WADDR_0_S  11
/** RMT_STATE_0 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL0.
 */
#define RMT_STATE_0    0x00000007
#define RMT_STATE_0_M  (RMT_STATE_0_V << RMT_STATE_0_S)
#define RMT_STATE_0_V  0x00000007
#define RMT_STATE_0_S  22
/** RMT_MEM_EMPTY_0 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_0    (BIT(25))
#define RMT_MEM_EMPTY_0_M  (RMT_MEM_EMPTY_0_V << RMT_MEM_EMPTY_0_S)
#define RMT_MEM_EMPTY_0_V  0x00000001
#define RMT_MEM_EMPTY_0_S  25
/** RMT_APB_MEM_WR_ERR_0 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_0    (BIT(26))
#define RMT_APB_MEM_WR_ERR_0_M  (RMT_APB_MEM_WR_ERR_0_V << RMT_APB_MEM_WR_ERR_0_S)
#define RMT_APB_MEM_WR_ERR_0_V  0x00000001
#define RMT_APB_MEM_WR_ERR_0_S  26

/** RMT_CH1STATUS_REG register
 *  Channel 1 status register
 */
#define RMT_CH1STATUS_REG (DR_REG_RMT_BASE + 0x54)
/** RMT_MEM_RADDR_EX_1 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL1 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_1    0x000003FF
#define RMT_MEM_RADDR_EX_1_M  (RMT_MEM_RADDR_EX_1_V << RMT_MEM_RADDR_EX_1_S)
#define RMT_MEM_RADDR_EX_1_V  0x000003FF
#define RMT_MEM_RADDR_EX_1_S  0
/** RMT_APB_MEM_WADDR_1 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_1    0x000003FF
#define RMT_APB_MEM_WADDR_1_M  (RMT_APB_MEM_WADDR_1_V << RMT_APB_MEM_WADDR_1_S)
#define RMT_APB_MEM_WADDR_1_V  0x000003FF
#define RMT_APB_MEM_WADDR_1_S  11
/** RMT_STATE_1 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL1.
 */
#define RMT_STATE_1    0x00000007
#define RMT_STATE_1_M  (RMT_STATE_1_V << RMT_STATE_1_S)
#define RMT_STATE_1_V  0x00000007
#define RMT_STATE_1_S  22
/** RMT_MEM_EMPTY_1 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_1    (BIT(25))
#define RMT_MEM_EMPTY_1_M  (RMT_MEM_EMPTY_1_V << RMT_MEM_EMPTY_1_S)
#define RMT_MEM_EMPTY_1_V  0x00000001
#define RMT_MEM_EMPTY_1_S  25
/** RMT_APB_MEM_WR_ERR_1 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_1    (BIT(26))
#define RMT_APB_MEM_WR_ERR_1_M  (RMT_APB_MEM_WR_ERR_1_V << RMT_APB_MEM_WR_ERR_1_S)
#define RMT_APB_MEM_WR_ERR_1_V  0x00000001
#define RMT_APB_MEM_WR_ERR_1_S  26

/** RMT_CH2STATUS_REG register
 *  Channel 2 status register
 */
#define RMT_CH2STATUS_REG (DR_REG_RMT_BASE + 0x58)
/** RMT_MEM_RADDR_EX_2 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL2 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_2    0x000003FF
#define RMT_MEM_RADDR_EX_2_M  (RMT_MEM_RADDR_EX_2_V << RMT_MEM_RADDR_EX_2_S)
#define RMT_MEM_RADDR_EX_2_V  0x000003FF
#define RMT_MEM_RADDR_EX_2_S  0
/** RMT_APB_MEM_WADDR_2 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_2    0x000003FF
#define RMT_APB_MEM_WADDR_2_M  (RMT_APB_MEM_WADDR_2_V << RMT_APB_MEM_WADDR_2_S)
#define RMT_APB_MEM_WADDR_2_V  0x000003FF
#define RMT_APB_MEM_WADDR_2_S  11
/** RMT_STATE_2 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL2.
 */
#define RMT_STATE_2    0x00000007
#define RMT_STATE_2_M  (RMT_STATE_2_V << RMT_STATE_2_S)
#define RMT_STATE_2_V  0x00000007
#define RMT_STATE_2_S  22
/** RMT_MEM_EMPTY_2 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_2    (BIT(25))
#define RMT_MEM_EMPTY_2_M  (RMT_MEM_EMPTY_2_V << RMT_MEM_EMPTY_2_S)
#define RMT_MEM_EMPTY_2_V  0x00000001
#define RMT_MEM_EMPTY_2_S  25
/** RMT_APB_MEM_WR_ERR_2 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_2    (BIT(26))
#define RMT_APB_MEM_WR_ERR_2_M  (RMT_APB_MEM_WR_ERR_2_V << RMT_APB_MEM_WR_ERR_2_S)
#define RMT_APB_MEM_WR_ERR_2_V  0x00000001
#define RMT_APB_MEM_WR_ERR_2_S  26

/** RMT_CH3STATUS_REG register
 *  Channel 3 status register
 */
#define RMT_CH3STATUS_REG (DR_REG_RMT_BASE + 0x5c)
/** RMT_MEM_RADDR_EX_3 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL3 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_3    0x000003FF
#define RMT_MEM_RADDR_EX_3_M  (RMT_MEM_RADDR_EX_3_V << RMT_MEM_RADDR_EX_3_S)
#define RMT_MEM_RADDR_EX_3_V  0x000003FF
#define RMT_MEM_RADDR_EX_3_S  0
/** RMT_APB_MEM_WADDR_3 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_3    0x000003FF
#define RMT_APB_MEM_WADDR_3_M  (RMT_APB_MEM_WADDR_3_V << RMT_APB_MEM_WADDR_3_S)
#define RMT_APB_MEM_WADDR_3_V  0x000003FF
#define RMT_APB_MEM_WADDR_3_S  11
/** RMT_STATE_3 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL3.
 */
#define RMT_STATE_3    0x00000007
#define RMT_STATE_3_M  (RMT_STATE_3_V << RMT_STATE_3_S)
#define RMT_STATE_3_V  0x00000007
#define RMT_STATE_3_S  22
/** RMT_MEM_EMPTY_3 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_3    (BIT(25))
#define RMT_MEM_EMPTY_3_M  (RMT_MEM_EMPTY_3_V << RMT_MEM_EMPTY_3_S)
#define RMT_MEM_EMPTY_3_V  0x00000001
#define RMT_MEM_EMPTY_3_S  25
/** RMT_APB_MEM_WR_ERR_3 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_3    (BIT(26))
#define RMT_APB_MEM_WR_ERR_3_M  (RMT_APB_MEM_WR_ERR_3_V << RMT_APB_MEM_WR_ERR_3_S)
#define RMT_APB_MEM_WR_ERR_3_V  0x00000001
#define RMT_APB_MEM_WR_ERR_3_S  26

/** RMT_CH4STATUS_REG register
 *  Channel 4 status register
 */
#define RMT_CH4STATUS_REG (DR_REG_RMT_BASE + 0x60)
/** RMT_MEM_WADDR_EX_4 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL4 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_4    0x000003FF
#define RMT_MEM_WADDR_EX_4_M  (RMT_MEM_WADDR_EX_4_V << RMT_MEM_WADDR_EX_4_S)
#define RMT_MEM_WADDR_EX_4_V  0x000003FF
#define RMT_MEM_WADDR_EX_4_S  0
/** RMT_APB_MEM_RADDR_4 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_4    0x000003FF
#define RMT_APB_MEM_RADDR_4_M  (RMT_APB_MEM_RADDR_4_V << RMT_APB_MEM_RADDR_4_S)
#define RMT_APB_MEM_RADDR_4_V  0x000003FF
#define RMT_APB_MEM_RADDR_4_S  11
/** RMT_STATE_4 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL4.
 */
#define RMT_STATE_4    0x00000007
#define RMT_STATE_4_M  (RMT_STATE_4_V << RMT_STATE_4_S)
#define RMT_STATE_4_V  0x00000007
#define RMT_STATE_4_S  22
/** RMT_MEM_OWNER_ERR_4 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_4    (BIT(25))
#define RMT_MEM_OWNER_ERR_4_M  (RMT_MEM_OWNER_ERR_4_V << RMT_MEM_OWNER_ERR_4_S)
#define RMT_MEM_OWNER_ERR_4_V  0x00000001
#define RMT_MEM_OWNER_ERR_4_S  25
/** RMT_MEM_FULL_4 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_4    (BIT(26))
#define RMT_MEM_FULL_4_M  (RMT_MEM_FULL_4_V << RMT_MEM_FULL_4_S)
#define RMT_MEM_FULL_4_V  0x00000001
#define RMT_MEM_FULL_4_S  26
/** RMT_APB_MEM_RD_ERR_4 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_4    (BIT(27))
#define RMT_APB_MEM_RD_ERR_4_M  (RMT_APB_MEM_RD_ERR_4_V << RMT_APB_MEM_RD_ERR_4_S)
#define RMT_APB_MEM_RD_ERR_4_V  0x00000001
#define RMT_APB_MEM_RD_ERR_4_S  27

/** RMT_CH5STATUS_REG register
 *  Channel 5 status register
 */
#define RMT_CH5STATUS_REG (DR_REG_RMT_BASE + 0x64)
/** RMT_MEM_WADDR_EX_5 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL5 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_5    0x000003FF
#define RMT_MEM_WADDR_EX_5_M  (RMT_MEM_WADDR_EX_5_V << RMT_MEM_WADDR_EX_5_S)
#define RMT_MEM_WADDR_EX_5_V  0x000003FF
#define RMT_MEM_WADDR_EX_5_S  0
/** RMT_APB_MEM_RADDR_5 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_5    0x000003FF
#define RMT_APB_MEM_RADDR_5_M  (RMT_APB_MEM_RADDR_5_V << RMT_APB_MEM_RADDR_5_S)
#define RMT_APB_MEM_RADDR_5_V  0x000003FF
#define RMT_APB_MEM_RADDR_5_S  11
/** RMT_STATE_5 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL5.
 */
#define RMT_STATE_5    0x00000007
#define RMT_STATE_5_M  (RMT_STATE_5_V << RMT_STATE_5_S)
#define RMT_STATE_5_V  0x00000007
#define RMT_STATE_5_S  22
/** RMT_MEM_OWNER_ERR_5 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_5    (BIT(25))
#define RMT_MEM_OWNER_ERR_5_M  (RMT_MEM_OWNER_ERR_5_V << RMT_MEM_OWNER_ERR_5_S)
#define RMT_MEM_OWNER_ERR_5_V  0x00000001
#define RMT_MEM_OWNER_ERR_5_S  25
/** RMT_MEM_FULL_5 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_5    (BIT(26))
#define RMT_MEM_FULL_5_M  (RMT_MEM_FULL_5_V << RMT_MEM_FULL_5_S)
#define RMT_MEM_FULL_5_V  0x00000001
#define RMT_MEM_FULL_5_S  26
/** RMT_APB_MEM_RD_ERR_5 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_5    (BIT(27))
#define RMT_APB_MEM_RD_ERR_5_M  (RMT_APB_MEM_RD_ERR_5_V << RMT_APB_MEM_RD_ERR_5_S)
#define RMT_APB_MEM_RD_ERR_5_V  0x00000001
#define RMT_APB_MEM_RD_ERR_5_S  27

/** RMT_CH6STATUS_REG register
 *  Channel 6 status register
 */
#define RMT_CH6STATUS_REG (DR_REG_RMT_BASE + 0x68)
/** RMT_MEM_WADDR_EX_6 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL6 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_6    0x000003FF
#define RMT_MEM_WADDR_EX_6_M  (RMT_MEM_WADDR_EX_6_V << RMT_MEM_WADDR_EX_6_S)
#define RMT_MEM_WADDR_EX_6_V  0x000003FF
#define RMT_MEM_WADDR_EX_6_S  0
/** RMT_APB_MEM_RADDR_6 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_6    0x000003FF
#define RMT_APB_MEM_RADDR_6_M  (RMT_APB_MEM_RADDR_6_V << RMT_APB_MEM_RADDR_6_S)
#define RMT_APB_MEM_RADDR_6_V  0x000003FF
#define RMT_APB_MEM_RADDR_6_S  11
/** RMT_STATE_6 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL6.
 */
#define RMT_STATE_6    0x00000007
#define RMT_STATE_6_M  (RMT_STATE_6_V << RMT_STATE_6_S)
#define RMT_STATE_6_V  0x00000007
#define RMT_STATE_6_S  22
/** RMT_MEM_OWNER_ERR_6 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_6    (BIT(25))
#define RMT_MEM_OWNER_ERR_6_M  (RMT_MEM_OWNER_ERR_6_V << RMT_MEM_OWNER_ERR_6_S)
#define RMT_MEM_OWNER_ERR_6_V  0x00000001
#define RMT_MEM_OWNER_ERR_6_S  25
/** RMT_MEM_FULL_6 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_6    (BIT(26))
#define RMT_MEM_FULL_6_M  (RMT_MEM_FULL_6_V << RMT_MEM_FULL_6_S)
#define RMT_MEM_FULL_6_V  0x00000001
#define RMT_MEM_FULL_6_S  26
/** RMT_APB_MEM_RD_ERR_6 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_6    (BIT(27))
#define RMT_APB_MEM_RD_ERR_6_M  (RMT_APB_MEM_RD_ERR_6_V << RMT_APB_MEM_RD_ERR_6_S)
#define RMT_APB_MEM_RD_ERR_6_V  0x00000001
#define RMT_APB_MEM_RD_ERR_6_S  27

/** RMT_CH7STATUS_REG register
 *  Channel 7 status register
 */
#define RMT_CH7STATUS_REG (DR_REG_RMT_BASE + 0x6c)
/** RMT_MEM_WADDR_EX_7 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL7 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_7    0x000003FF
#define RMT_MEM_WADDR_EX_7_M  (RMT_MEM_WADDR_EX_7_V << RMT_MEM_WADDR_EX_7_S)
#define RMT_MEM_WADDR_EX_7_V  0x000003FF
#define RMT_MEM_WADDR_EX_7_S  0
/** RMT_APB_MEM_RADDR_7 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_7    0x000003FF
#define RMT_APB_MEM_RADDR_7_M  (RMT_APB_MEM_RADDR_7_V << RMT_APB_MEM_RADDR_7_S)
#define RMT_APB_MEM_RADDR_7_V  0x000003FF
#define RMT_APB_MEM_RADDR_7_S  11
/** RMT_STATE_7 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL7.
 */
#define RMT_STATE_7    0x00000007
#define RMT_STATE_7_M  (RMT_STATE_7_V << RMT_STATE_7_S)
#define RMT_STATE_7_V  0x00000007
#define RMT_STATE_7_S  22
/** RMT_MEM_OWNER_ERR_7 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_7    (BIT(25))
#define RMT_MEM_OWNER_ERR_7_M  (RMT_MEM_OWNER_ERR_7_V << RMT_MEM_OWNER_ERR_7_S)
#define RMT_MEM_OWNER_ERR_7_V  0x00000001
#define RMT_MEM_OWNER_ERR_7_S  25
/** RMT_MEM_FULL_7 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_7    (BIT(26))
#define RMT_MEM_FULL_7_M  (RMT_MEM_FULL_7_V << RMT_MEM_FULL_7_S)
#define RMT_MEM_FULL_7_V  0x00000001
#define RMT_MEM_FULL_7_S  26
/** RMT_APB_MEM_RD_ERR_7 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_7    (BIT(27))
#define RMT_APB_MEM_RD_ERR_7_M  (RMT_APB_MEM_RD_ERR_7_V << RMT_APB_MEM_RD_ERR_7_S)
#define RMT_APB_MEM_RD_ERR_7_V  0x00000001
#define RMT_APB_MEM_RD_ERR_7_S  27

