espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_INT_RAW_REG register
 *  Raw interrupt status
 */
#define RMT_INT_RAW_REG (DR_REG_RMT_BASE + 0x70)
/** RMT_CH0_TX_END_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The interrupt raw bit for CHANNEL0. Triggered when transmission done.
 */
#define RMT_CH0_TX_END_INT_RAW    (BIT(0))
#define RMT_CH0_TX_END_INT_RAW_M  (RMT_CH0_TX_END_INT_RAW_V << RMT_CH0_TX_END_INT_RAW_S)
#define RMT_CH0_TX_END_INT_RAW_V  0x00000001
#define RMT_CH0_TX_END_INT_RAW_S  0
/** RMT_CH1_TX_END_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The interrupt raw bit for CHANNEL1. Triggered when transmission done.
 */
#define RMT_CH1_TX_END_INT_RAW    (BIT(1))
#define RMT_CH1_TX_END_INT_RAW_M  (RMT_CH1_TX_END_INT_RAW_V << RMT_CH1_TX_END_INT_RAW_S)
#define RMT_CH1_TX_END_INT_RAW_V  0x00000001
#define RMT_CH1_TX_END_INT_RAW_S  1
/** RMT_CH2_TX_END_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The interrupt raw bit for CHANNEL2. Triggered when transmission done.
 */
#define RMT_CH2_TX_END_INT_RAW    (BIT(2))
#define RMT_CH2_TX_END_INT_RAW_M  (RMT_CH2_TX_END_INT_RAW_V << RMT_CH2_TX_END_INT_RAW_S)
#define RMT_CH2_TX_END_INT_RAW_V  0x00000001
#define RMT_CH2_TX_END_INT_RAW_S  2
/** RMT_CH3_TX_END_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The interrupt raw bit for CHANNEL3. Triggered when transmission done.
 */
#define RMT_CH3_TX_END_INT_RAW    (BIT(3))
#define RMT_CH3_TX_END_INT_RAW_M  (RMT_CH3_TX_END_INT_RAW_V << RMT_CH3_TX_END_INT_RAW_S)
#define RMT_CH3_TX_END_INT_RAW_V  0x00000001
#define RMT_CH3_TX_END_INT_RAW_S  3
/** RMT_CH0_ERR_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The interrupt raw bit for CHANNEL0. Triggered when error occurs.
 */
#define RMT_CH0_ERR_INT_RAW    (BIT(4))
#define RMT_CH0_ERR_INT_RAW_M  (RMT_CH0_ERR_INT_RAW_V << RMT_CH0_ERR_INT_RAW_S)
#define RMT_CH0_ERR_INT_RAW_V  0x00000001
#define RMT_CH0_ERR_INT_RAW_S  4
/** RMT_CH1_ERR_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The interrupt raw bit for CHANNEL1. Triggered when error occurs.
 */
#define RMT_CH1_ERR_INT_RAW    (BIT(5))
#define RMT_CH1_ERR_INT_RAW_M  (RMT_CH1_ERR_INT_RAW_V << RMT_CH1_ERR_INT_RAW_S)
#define RMT_CH1_ERR_INT_RAW_V  0x00000001
#define RMT_CH1_ERR_INT_RAW_S  5
/** RMT_CH2_ERR_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The interrupt raw bit for CHANNEL2. Triggered when error occurs.
 */
#define RMT_CH2_ERR_INT_RAW    (BIT(6))
#define RMT_CH2_ERR_INT_RAW_M  (RMT_CH2_ERR_INT_RAW_V << RMT_CH2_ERR_INT_RAW_S)
#define RMT_CH2_ERR_INT_RAW_V  0x00000001
#define RMT_CH2_ERR_INT_RAW_S  6
/** RMT_CH3_ERR_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The interrupt raw bit for CHANNEL3. Triggered when error occurs.
 */
#define RMT_CH3_ERR_INT_RAW    (BIT(7))
#define RMT_CH3_ERR_INT_RAW_M  (RMT_CH3_ERR_INT_RAW_V << RMT_CH3_ERR_INT_RAW_S)
#define RMT_CH3_ERR_INT_RAW_V  0x00000001
#define RMT_CH3_ERR_INT_RAW_S  7
/** RMT_CH0_TX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The interrupt raw bit for CHANNEL0. Triggered when transmitter sent more data than
 *  configured value.
 */
#define RMT_CH0_TX_THR_EVENT_INT_RAW    (BIT(8))
#define RMT_CH0_TX_THR_EVENT_INT_RAW_M  (RMT_CH0_TX_THR_EVENT_INT_RAW_V << RMT_CH0_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH0_TX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH0_TX_THR_EVENT_INT_RAW_S  8
/** RMT_CH1_TX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The interrupt raw bit for CHANNEL1. Triggered when transmitter sent more data than
 *  configured value.
 */
#define RMT_CH1_TX_THR_EVENT_INT_RAW    (BIT(9))
#define RMT_CH1_TX_THR_EVENT_INT_RAW_M  (RMT_CH1_TX_THR_EVENT_INT_RAW_V << RMT_CH1_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH1_TX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH1_TX_THR_EVENT_INT_RAW_S  9
/** RMT_CH2_TX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The interrupt raw bit for CHANNEL2. Triggered when transmitter sent more data than
 *  configured value.
 */
#define RMT_CH2_TX_THR_EVENT_INT_RAW    (BIT(10))
#define RMT_CH2_TX_THR_EVENT_INT_RAW_M  (RMT_CH2_TX_THR_EVENT_INT_RAW_V << RMT_CH2_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH2_TX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH2_TX_THR_EVENT_INT_RAW_S  10
/** RMT_CH3_TX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The interrupt raw bit for CHANNEL3. Triggered when transmitter sent more data than
 *  configured value.
 */
#define RMT_CH3_TX_THR_EVENT_INT_RAW    (BIT(11))
#define RMT_CH3_TX_THR_EVENT_INT_RAW_M  (RMT_CH3_TX_THR_EVENT_INT_RAW_V << RMT_CH3_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH3_TX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH3_TX_THR_EVENT_INT_RAW_S  11
/** RMT_CH0_TX_LOOP_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The interrupt raw bit for CHANNEL0. Triggered when the loop count reaches the
 *  configured threshold value.
 */
#define RMT_CH0_TX_LOOP_INT_RAW    (BIT(12))
#define RMT_CH0_TX_LOOP_INT_RAW_M  (RMT_CH0_TX_LOOP_INT_RAW_V << RMT_CH0_TX_LOOP_INT_RAW_S)
#define RMT_CH0_TX_LOOP_INT_RAW_V  0x00000001
#define RMT_CH0_TX_LOOP_INT_RAW_S  12
/** RMT_CH1_TX_LOOP_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The interrupt raw bit for CHANNEL1. Triggered when the loop count reaches the
 *  configured threshold value.
 */
#define RMT_CH1_TX_LOOP_INT_RAW    (BIT(13))
#define RMT_CH1_TX_LOOP_INT_RAW_M  (RMT_CH1_TX_LOOP_INT_RAW_V << RMT_CH1_TX_LOOP_INT_RAW_S)
#define RMT_CH1_TX_LOOP_INT_RAW_V  0x00000001
#define RMT_CH1_TX_LOOP_INT_RAW_S  13
/** RMT_CH2_TX_LOOP_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The interrupt raw bit for CHANNEL2. Triggered when the loop count reaches the
 *  configured threshold value.
 */
#define RMT_CH2_TX_LOOP_INT_RAW    (BIT(14))
#define RMT_CH2_TX_LOOP_INT_RAW_M  (RMT_CH2_TX_LOOP_INT_RAW_V << RMT_CH2_TX_LOOP_INT_RAW_S)
#define RMT_CH2_TX_LOOP_INT_RAW_V  0x00000001
#define RMT_CH2_TX_LOOP_INT_RAW_S  14
/** RMT_CH3_TX_LOOP_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The interrupt raw bit for CHANNEL3. Triggered when the loop count reaches the
 *  configured threshold value.
 */
#define RMT_CH3_TX_LOOP_INT_RAW    (BIT(15))
#define RMT_CH3_TX_LOOP_INT_RAW_M  (RMT_CH3_TX_LOOP_INT_RAW_V << RMT_CH3_TX_LOOP_INT_RAW_S)
#define RMT_CH3_TX_LOOP_INT_RAW_V  0x00000001
#define RMT_CH3_TX_LOOP_INT_RAW_S  15
/** RMT_CH4_RX_END_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The interrupt raw bit for CHANNEL4. Triggered when reception done.
 */
#define RMT_CH4_RX_END_INT_RAW    (BIT(16))
#define RMT_CH4_RX_END_INT_RAW_M  (RMT_CH4_RX_END_INT_RAW_V << RMT_CH4_RX_END_INT_RAW_S)
#define RMT_CH4_RX_END_INT_RAW_V  0x00000001
#define RMT_CH4_RX_END_INT_RAW_S  16
/** RMT_CH5_RX_END_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The interrupt raw bit for CHANNEL5. Triggered when reception done.
 */
#define RMT_CH5_RX_END_INT_RAW    (BIT(17))
#define RMT_CH5_RX_END_INT_RAW_M  (RMT_CH5_RX_END_INT_RAW_V << RMT_CH5_RX_END_INT_RAW_S)
#define RMT_CH5_RX_END_INT_RAW_V  0x00000001
#define RMT_CH5_RX_END_INT_RAW_S  17
/** RMT_CH6_RX_END_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The interrupt raw bit for CHANNEL6. Triggered when reception done.
 */
#define RMT_CH6_RX_END_INT_RAW    (BIT(18))
#define RMT_CH6_RX_END_INT_RAW_M  (RMT_CH6_RX_END_INT_RAW_V << RMT_CH6_RX_END_INT_RAW_S)
#define RMT_CH6_RX_END_INT_RAW_V  0x00000001
#define RMT_CH6_RX_END_INT_RAW_S  18
/** RMT_CH7_RX_END_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The interrupt raw bit for CHANNEL7. Triggered when reception done.
 */
#define RMT_CH7_RX_END_INT_RAW    (BIT(19))
#define RMT_CH7_RX_END_INT_RAW_M  (RMT_CH7_RX_END_INT_RAW_V << RMT_CH7_RX_END_INT_RAW_S)
#define RMT_CH7_RX_END_INT_RAW_V  0x00000001
#define RMT_CH7_RX_END_INT_RAW_S  19
/** RMT_CH4_ERR_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The interrupt raw bit for CHANNEL4. Triggered when error occurs.
 */
#define RMT_CH4_ERR_INT_RAW    (BIT(20))
#define RMT_CH4_ERR_INT_RAW_M  (RMT_CH4_ERR_INT_RAW_V << RMT_CH4_ERR_INT_RAW_S)
#define RMT_CH4_ERR_INT_RAW_V  0x00000001
#define RMT_CH4_ERR_INT_RAW_S  20
/** RMT_CH5_ERR_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  The interrupt raw bit for CHANNEL5. Triggered when error occurs.
 */
#define RMT_CH5_ERR_INT_RAW    (BIT(21))
#define RMT_CH5_ERR_INT_RAW_M  (RMT_CH5_ERR_INT_RAW_V << RMT_CH5_ERR_INT_RAW_S)
#define RMT_CH5_ERR_INT_RAW_V  0x00000001
#define RMT_CH5_ERR_INT_RAW_S  21
/** RMT_CH6_ERR_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  The interrupt raw bit for CHANNEL6. Triggered when error occurs.
 */
#define RMT_CH6_ERR_INT_RAW    (BIT(22))
#define RMT_CH6_ERR_INT_RAW_M  (RMT_CH6_ERR_INT_RAW_V << RMT_CH6_ERR_INT_RAW_S)
#define RMT_CH6_ERR_INT_RAW_V  0x00000001
#define RMT_CH6_ERR_INT_RAW_S  22
/** RMT_CH7_ERR_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  The interrupt raw bit for CHANNEL7. Triggered when error occurs.
 */
#define RMT_CH7_ERR_INT_RAW    (BIT(23))
#define RMT_CH7_ERR_INT_RAW_M  (RMT_CH7_ERR_INT_RAW_V << RMT_CH7_ERR_INT_RAW_S)
#define RMT_CH7_ERR_INT_RAW_V  0x00000001
#define RMT_CH7_ERR_INT_RAW_S  23
/** RMT_CH4_RX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  The interrupt raw bit for CHANNEL4. Triggered when receiver receive more data than
 *  configured value.
 */
#define RMT_CH4_RX_THR_EVENT_INT_RAW    (BIT(24))
#define RMT_CH4_RX_THR_EVENT_INT_RAW_M  (RMT_CH4_RX_THR_EVENT_INT_RAW_V << RMT_CH4_RX_THR_EVENT_INT_RAW_S)
#define RMT_CH4_RX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH4_RX_THR_EVENT_INT_RAW_S  24
/** RMT_CH5_RX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  The interrupt raw bit for CHANNEL5. Triggered when receiver receive more data than
 *  configured value.
 */
#define RMT_CH5_RX_THR_EVENT_INT_RAW    (BIT(25))
#define RMT_CH5_RX_THR_EVENT_INT_RAW_M  (RMT_CH5_RX_THR_EVENT_INT_RAW_V << RMT_CH5_RX_THR_EVENT_INT_RAW_S)
#define RMT_CH5_RX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH5_RX_THR_EVENT_INT_RAW_S  25
/** RMT_CH6_RX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  The interrupt raw bit for CHANNEL6. Triggered when receiver receive more data than
 *  configured value.
 */
#define RMT_CH6_RX_THR_EVENT_INT_RAW    (BIT(26))
#define RMT_CH6_RX_THR_EVENT_INT_RAW_M  (RMT_CH6_RX_THR_EVENT_INT_RAW_V << RMT_CH6_RX_THR_EVENT_INT_RAW_S)
#define RMT_CH6_RX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH6_RX_THR_EVENT_INT_RAW_S  26
/** RMT_CH7_RX_THR_EVENT_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  The interrupt raw bit for CHANNEL7. Triggered when receiver receive more data than
 *  configured value.
 */
#define RMT_CH7_RX_THR_EVENT_INT_RAW    (BIT(27))
#define RMT_CH7_RX_THR_EVENT_INT_RAW_M  (RMT_CH7_RX_THR_EVENT_INT_RAW_V << RMT_CH7_RX_THR_EVENT_INT_RAW_S)
#define RMT_CH7_RX_THR_EVENT_INT_RAW_V  0x00000001
#define RMT_CH7_RX_THR_EVENT_INT_RAW_S  27

/** RMT_INT_ST_REG register
 *  Masked interrupt status
 */
#define RMT_INT_ST_REG (DR_REG_RMT_BASE + 0x74)
/** RMT_CH0_TX_END_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit for CH0_TX_END_INT.
 */
#define RMT_CH0_TX_END_INT_ST    (BIT(0))
#define RMT_CH0_TX_END_INT_ST_M  (RMT_CH0_TX_END_INT_ST_V << RMT_CH0_TX_END_INT_ST_S)
#define RMT_CH0_TX_END_INT_ST_V  0x00000001
#define RMT_CH0_TX_END_INT_ST_S  0
/** RMT_CH1_TX_END_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit for CH1_TX_END_INT.
 */
#define RMT_CH1_TX_END_INT_ST    (BIT(1))
#define RMT_CH1_TX_END_INT_ST_M  (RMT_CH1_TX_END_INT_ST_V << RMT_CH1_TX_END_INT_ST_S)
#define RMT_CH1_TX_END_INT_ST_V  0x00000001
#define RMT_CH1_TX_END_INT_ST_S  1
/** RMT_CH2_TX_END_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit for CH2_TX_END_INT.
 */
#define RMT_CH2_TX_END_INT_ST    (BIT(2))
#define RMT_CH2_TX_END_INT_ST_M  (RMT_CH2_TX_END_INT_ST_V << RMT_CH2_TX_END_INT_ST_S)
#define RMT_CH2_TX_END_INT_ST_V  0x00000001
#define RMT_CH2_TX_END_INT_ST_S  2
/** RMT_CH3_TX_END_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit for CH3_TX_END_INT.
 */
#define RMT_CH3_TX_END_INT_ST    (BIT(3))
#define RMT_CH3_TX_END_INT_ST_M  (RMT_CH3_TX_END_INT_ST_V << RMT_CH3_TX_END_INT_ST_S)
#define RMT_CH3_TX_END_INT_ST_V  0x00000001
#define RMT_CH3_TX_END_INT_ST_S  3
/** RMT_CH0_ERR_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status bit for CH0_ERR_INT.
 */
#define RMT_CH0_ERR_INT_ST    (BIT(4))
#define RMT_CH0_ERR_INT_ST_M  (RMT_CH0_ERR_INT_ST_V << RMT_CH0_ERR_INT_ST_S)
#define RMT_CH0_ERR_INT_ST_V  0x00000001
#define RMT_CH0_ERR_INT_ST_S  4
/** RMT_CH1_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status bit for CH1_ERR_INT.
 */
#define RMT_CH1_ERR_INT_ST    (BIT(5))
#define RMT_CH1_ERR_INT_ST_M  (RMT_CH1_ERR_INT_ST_V << RMT_CH1_ERR_INT_ST_S)
#define RMT_CH1_ERR_INT_ST_V  0x00000001
#define RMT_CH1_ERR_INT_ST_S  5
/** RMT_CH2_ERR_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status bit for CH2_ERR_INT.
 */
#define RMT_CH2_ERR_INT_ST    (BIT(6))
#define RMT_CH2_ERR_INT_ST_M  (RMT_CH2_ERR_INT_ST_V << RMT_CH2_ERR_INT_ST_S)
#define RMT_CH2_ERR_INT_ST_V  0x00000001
#define RMT_CH2_ERR_INT_ST_S  6
/** RMT_CH3_ERR_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status bit for CH3_ERR_INT.
 */
#define RMT_CH3_ERR_INT_ST    (BIT(7))
#define RMT_CH3_ERR_INT_ST_M  (RMT_CH3_ERR_INT_ST_V << RMT_CH3_ERR_INT_ST_S)
#define RMT_CH3_ERR_INT_ST_V  0x00000001
#define RMT_CH3_ERR_INT_ST_S  7
/** RMT_CH0_TX_THR_EVENT_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status bit for CH0_TX_THR_EVENT_INT.
 */
#define RMT_CH0_TX_THR_EVENT_INT_ST    (BIT(8))
#define RMT_CH0_TX_THR_EVENT_INT_ST_M  (RMT_CH0_TX_THR_EVENT_INT_ST_V << RMT_CH0_TX_THR_EVENT_INT_ST_S)
#define RMT_CH0_TX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH0_TX_THR_EVENT_INT_ST_S  8
/** RMT_CH1_TX_THR_EVENT_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status bit for CH1_TX_THR_EVENT_INT.
 */
#define RMT_CH1_TX_THR_EVENT_INT_ST    (BIT(9))
#define RMT_CH1_TX_THR_EVENT_INT_ST_M  (RMT_CH1_TX_THR_EVENT_INT_ST_V << RMT_CH1_TX_THR_EVENT_INT_ST_S)
#define RMT_CH1_TX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH1_TX_THR_EVENT_INT_ST_S  9
/** RMT_CH2_TX_THR_EVENT_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status bit for CH2_TX_THR_EVENT_INT.
 */
#define RMT_CH2_TX_THR_EVENT_INT_ST    (BIT(10))
#define RMT_CH2_TX_THR_EVENT_INT_ST_M  (RMT_CH2_TX_THR_EVENT_INT_ST_V << RMT_CH2_TX_THR_EVENT_INT_ST_S)
#define RMT_CH2_TX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH2_TX_THR_EVENT_INT_ST_S  10
/** RMT_CH3_TX_THR_EVENT_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status bit for CH3_TX_THR_EVENT_INT.
 */
#define RMT_CH3_TX_THR_EVENT_INT_ST    (BIT(11))
#define RMT_CH3_TX_THR_EVENT_INT_ST_M  (RMT_CH3_TX_THR_EVENT_INT_ST_V << RMT_CH3_TX_THR_EVENT_INT_ST_S)
#define RMT_CH3_TX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH3_TX_THR_EVENT_INT_ST_S  11
/** RMT_CH0_TX_LOOP_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status bit for CH0_TX_LOOP_INT.
 */
#define RMT_CH0_TX_LOOP_INT_ST    (BIT(12))
#define RMT_CH0_TX_LOOP_INT_ST_M  (RMT_CH0_TX_LOOP_INT_ST_V << RMT_CH0_TX_LOOP_INT_ST_S)
#define RMT_CH0_TX_LOOP_INT_ST_V  0x00000001
#define RMT_CH0_TX_LOOP_INT_ST_S  12
/** RMT_CH1_TX_LOOP_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked interrupt status bit for CH1_TX_LOOP_INT.
 */
#define RMT_CH1_TX_LOOP_INT_ST    (BIT(13))
#define RMT_CH1_TX_LOOP_INT_ST_M  (RMT_CH1_TX_LOOP_INT_ST_V << RMT_CH1_TX_LOOP_INT_ST_S)
#define RMT_CH1_TX_LOOP_INT_ST_V  0x00000001
#define RMT_CH1_TX_LOOP_INT_ST_S  13
/** RMT_CH2_TX_LOOP_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked interrupt status bit for CH2_TX_LOOP_INT.
 */
#define RMT_CH2_TX_LOOP_INT_ST    (BIT(14))
#define RMT_CH2_TX_LOOP_INT_ST_M  (RMT_CH2_TX_LOOP_INT_ST_V << RMT_CH2_TX_LOOP_INT_ST_S)
#define RMT_CH2_TX_LOOP_INT_ST_V  0x00000001
#define RMT_CH2_TX_LOOP_INT_ST_S  14
/** RMT_CH3_TX_LOOP_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked interrupt status bit for CH3_TX_LOOP_INT.
 */
#define RMT_CH3_TX_LOOP_INT_ST    (BIT(15))
#define RMT_CH3_TX_LOOP_INT_ST_M  (RMT_CH3_TX_LOOP_INT_ST_V << RMT_CH3_TX_LOOP_INT_ST_S)
#define RMT_CH3_TX_LOOP_INT_ST_V  0x00000001
#define RMT_CH3_TX_LOOP_INT_ST_S  15
/** RMT_CH4_RX_END_INT_ST : RO; bitpos: [16]; default: 0;
 *  The masked interrupt status bit for CH4_RX_END_INT.
 */
#define RMT_CH4_RX_END_INT_ST    (BIT(16))
#define RMT_CH4_RX_END_INT_ST_M  (RMT_CH4_RX_END_INT_ST_V << RMT_CH4_RX_END_INT_ST_S)
#define RMT_CH4_RX_END_INT_ST_V  0x00000001
#define RMT_CH4_RX_END_INT_ST_S  16
/** RMT_CH5_RX_END_INT_ST : RO; bitpos: [17]; default: 0;
 *  The masked interrupt status bit for CH5_RX_END_INT.
 */
#define RMT_CH5_RX_END_INT_ST    (BIT(17))
#define RMT_CH5_RX_END_INT_ST_M  (RMT_CH5_RX_END_INT_ST_V << RMT_CH5_RX_END_INT_ST_S)
#define RMT_CH5_RX_END_INT_ST_V  0x00000001
#define RMT_CH5_RX_END_INT_ST_S  17
/** RMT_CH6_RX_END_INT_ST : RO; bitpos: [18]; default: 0;
 *  The masked interrupt status bit for CH6_RX_END_INT.
 */
#define RMT_CH6_RX_END_INT_ST    (BIT(18))
#define RMT_CH6_RX_END_INT_ST_M  (RMT_CH6_RX_END_INT_ST_V << RMT_CH6_RX_END_INT_ST_S)
#define RMT_CH6_RX_END_INT_ST_V  0x00000001
#define RMT_CH6_RX_END_INT_ST_S  18
/** RMT_CH7_RX_END_INT_ST : RO; bitpos: [19]; default: 0;
 *  The masked interrupt status bit for CH7_RX_END_INT.
 */
#define RMT_CH7_RX_END_INT_ST    (BIT(19))
#define RMT_CH7_RX_END_INT_ST_M  (RMT_CH7_RX_END_INT_ST_V << RMT_CH7_RX_END_INT_ST_S)
#define RMT_CH7_RX_END_INT_ST_V  0x00000001
#define RMT_CH7_RX_END_INT_ST_S  19
/** RMT_CH4_ERR_INT_ST : RO; bitpos: [20]; default: 0;
 *  The masked interrupt status bit for CH4_ERR_INT.
 */
#define RMT_CH4_ERR_INT_ST    (BIT(20))
#define RMT_CH4_ERR_INT_ST_M  (RMT_CH4_ERR_INT_ST_V << RMT_CH4_ERR_INT_ST_S)
#define RMT_CH4_ERR_INT_ST_V  0x00000001
#define RMT_CH4_ERR_INT_ST_S  20
/** RMT_CH5_ERR_INT_ST : RO; bitpos: [21]; default: 0;
 *  The masked interrupt status bit for CH5_ERR_INT.
 */
#define RMT_CH5_ERR_INT_ST    (BIT(21))
#define RMT_CH5_ERR_INT_ST_M  (RMT_CH5_ERR_INT_ST_V << RMT_CH5_ERR_INT_ST_S)
#define RMT_CH5_ERR_INT_ST_V  0x00000001
#define RMT_CH5_ERR_INT_ST_S  21
/** RMT_CH6_ERR_INT_ST : RO; bitpos: [22]; default: 0;
 *  The masked interrupt status bit for CH6_ERR_INT.
 */
#define RMT_CH6_ERR_INT_ST    (BIT(22))
#define RMT_CH6_ERR_INT_ST_M  (RMT_CH6_ERR_INT_ST_V << RMT_CH6_ERR_INT_ST_S)
#define RMT_CH6_ERR_INT_ST_V  0x00000001
#define RMT_CH6_ERR_INT_ST_S  22
/** RMT_CH7_ERR_INT_ST : RO; bitpos: [23]; default: 0;
 *  The masked interrupt status bit for CH7_ERR_INT.
 */
#define RMT_CH7_ERR_INT_ST    (BIT(23))
#define RMT_CH7_ERR_INT_ST_M  (RMT_CH7_ERR_INT_ST_V << RMT_CH7_ERR_INT_ST_S)
#define RMT_CH7_ERR_INT_ST_V  0x00000001
#define RMT_CH7_ERR_INT_ST_S  23
/** RMT_CH4_RX_THR_EVENT_INT_ST : RO; bitpos: [24]; default: 0;
 *  The masked interrupt status bit for CH4_RX_THR_EVENT_INT.
 */
#define RMT_CH4_RX_THR_EVENT_INT_ST    (BIT(24))
#define RMT_CH4_RX_THR_EVENT_INT_ST_M  (RMT_CH4_RX_THR_EVENT_INT_ST_V << RMT_CH4_RX_THR_EVENT_INT_ST_S)
#define RMT_CH4_RX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH4_RX_THR_EVENT_INT_ST_S  24
/** RMT_CH5_RX_THR_EVENT_INT_ST : RO; bitpos: [25]; default: 0;
 *  The masked interrupt status bit for CH5_RX_THR_EVENT_INT.
 */
#define RMT_CH5_RX_THR_EVENT_INT_ST    (BIT(25))
#define RMT_CH5_RX_THR_EVENT_INT_ST_M  (RMT_CH5_RX_THR_EVENT_INT_ST_V << RMT_CH5_RX_THR_EVENT_INT_ST_S)
#define RMT_CH5_RX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH5_RX_THR_EVENT_INT_ST_S  25
/** RMT_CH6_RX_THR_EVENT_INT_ST : RO; bitpos: [26]; default: 0;
 *  The masked interrupt status bit for CH6_RX_THR_EVENT_INT.
 */
#define RMT_CH6_RX_THR_EVENT_INT_ST    (BIT(26))
#define RMT_CH6_RX_THR_EVENT_INT_ST_M  (RMT_CH6_RX_THR_EVENT_INT_ST_V << RMT_CH6_RX_THR_EVENT_INT_ST_S)
#define RMT_CH6_RX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH6_RX_THR_EVENT_INT_ST_S  26
/** RMT_CH7_RX_THR_EVENT_INT_ST : RO; bitpos: [27]; default: 0;
 *  The masked interrupt status bit for CH7_RX_THR_EVENT_INT.
 */
#define RMT_CH7_RX_THR_EVENT_INT_ST    (BIT(27))
#define RMT_CH7_RX_THR_EVENT_INT_ST_M  (RMT_CH7_RX_THR_EVENT_INT_ST_V << RMT_CH7_RX_THR_EVENT_INT_ST_S)
#define RMT_CH7_RX_THR_EVENT_INT_ST_V  0x00000001
#define RMT_CH7_RX_THR_EVENT_INT_ST_S  27

