espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_INT_ENA_REG register
 *  Interrupt enable bits
 */
#define RMT_INT_ENA_REG (DR_REG_RMT_BASE + 0x78)
/** RMT_CH0_TX_END_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for CH0_TX_END_INT.
 */
#define RMT_CH0_TX_END_INT_ENA    (BIT(0))
#define RMT_CH0_TX_END_INT_ENA_M  (RMT_CH0_TX_END_INT_ENA_V << RMT_CH0_TX_END_INT_ENA_S)
#define RMT_CH0_TX_END_INT_ENA_V  0x00000001
#define RMT_CH0_TX_END_INT_ENA_S  0
/** RMT_CH1_TX_END_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for CH1_TX_END_INT.
 */
#define RMT_CH1_TX_END_INT_ENA    (BIT(1))
#define RMT_CH1_TX_END_INT_ENA_M  (RMT_CH1_TX_END_INT_ENA_V << RMT_CH1_TX_END_INT_ENA_S)
#define RMT_CH1_TX_END_INT_ENA_V  0x00000001
#define RMT_CH1_TX_END_INT_ENA_S  1
/** RMT_CH2_TX_END_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for CH2_TX_END_INT.
 */
#define RMT_CH2_TX_END_INT_ENA    (BIT(2))
#define RMT_CH2_TX_END_INT_ENA_M  (RMT_CH2_TX_END_INT_ENA_V << RMT_CH2_TX_END_INT_ENA_S)
#define RMT_CH2_TX_END_INT_ENA_V  0x00000001
#define RMT_CH2_TX_END_INT_ENA_S  2
/** RMT_CH3_TX_END_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for CH3_TX_END_INT.
 */
#define RMT_CH3_TX_END_INT_ENA    (BIT(3))
#define RMT_CH3_TX_END_INT_ENA_M  (RMT_CH3_TX_END_INT_ENA_V << RMT_CH3_TX_END_INT_ENA_S)
#define RMT_CH3_TX_END_INT_ENA_V  0x00000001
#define RMT_CH3_TX_END_INT_ENA_S  3
/** RMT_CH0_ERR_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for CH0_ERR_INT.
 */
#define RMT_CH0_ERR_INT_ENA    (BIT(4))
#define RMT_CH0_ERR_INT_ENA_M  (RMT_CH0_ERR_INT_ENA_V << RMT_CH0_ERR_INT_ENA_S)
#define RMT_CH0_ERR_INT_ENA_V  0x00000001
#define RMT_CH0_ERR_INT_ENA_S  4
/** RMT_CH1_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for CH1_ERR_INT.
 */
#define RMT_CH1_ERR_INT_ENA    (BIT(5))
#define RMT_CH1_ERR_INT_ENA_M  (RMT_CH1_ERR_INT_ENA_V << RMT_CH1_ERR_INT_ENA_S)
#define RMT_CH1_ERR_INT_ENA_V  0x00000001
#define RMT_CH1_ERR_INT_ENA_S  5
/** RMT_CH2_ERR_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for CH2_ERR_INT.
 */
#define RMT_CH2_ERR_INT_ENA    (BIT(6))
#define RMT_CH2_ERR_INT_ENA_M  (RMT_CH2_ERR_INT_ENA_V << RMT_CH2_ERR_INT_ENA_S)
#define RMT_CH2_ERR_INT_ENA_V  0x00000001
#define RMT_CH2_ERR_INT_ENA_S  6
/** RMT_CH3_ERR_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for CH3_ERR_INT.
 */
#define RMT_CH3_ERR_INT_ENA    (BIT(7))
#define RMT_CH3_ERR_INT_ENA_M  (RMT_CH3_ERR_INT_ENA_V << RMT_CH3_ERR_INT_ENA_S)
#define RMT_CH3_ERR_INT_ENA_V  0x00000001
#define RMT_CH3_ERR_INT_ENA_S  7
/** RMT_CH0_TX_THR_EVENT_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for CH0_TX_THR_EVENT_INT.
 */
#define RMT_CH0_TX_THR_EVENT_INT_ENA    (BIT(8))
#define RMT_CH0_TX_THR_EVENT_INT_ENA_M  (RMT_CH0_TX_THR_EVENT_INT_ENA_V << RMT_CH0_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH0_TX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH0_TX_THR_EVENT_INT_ENA_S  8
/** RMT_CH1_TX_THR_EVENT_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for CH1_TX_THR_EVENT_INT.
 */
#define RMT_CH1_TX_THR_EVENT_INT_ENA    (BIT(9))
#define RMT_CH1_TX_THR_EVENT_INT_ENA_M  (RMT_CH1_TX_THR_EVENT_INT_ENA_V << RMT_CH1_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH1_TX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH1_TX_THR_EVENT_INT_ENA_S  9
/** RMT_CH2_TX_THR_EVENT_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for CH2_TX_THR_EVENT_INT.
 */
#define RMT_CH2_TX_THR_EVENT_INT_ENA    (BIT(10))
#define RMT_CH2_TX_THR_EVENT_INT_ENA_M  (RMT_CH2_TX_THR_EVENT_INT_ENA_V << RMT_CH2_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH2_TX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH2_TX_THR_EVENT_INT_ENA_S  10
/** RMT_CH3_TX_THR_EVENT_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enable bit for CH3_TX_THR_EVENT_INT.
 */
#define RMT_CH3_TX_THR_EVENT_INT_ENA    (BIT(11))
#define RMT_CH3_TX_THR_EVENT_INT_ENA_M  (RMT_CH3_TX_THR_EVENT_INT_ENA_V << RMT_CH3_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH3_TX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH3_TX_THR_EVENT_INT_ENA_S  11
/** RMT_CH0_TX_LOOP_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enable bit for CH0_TX_LOOP_INT.
 */
#define RMT_CH0_TX_LOOP_INT_ENA    (BIT(12))
#define RMT_CH0_TX_LOOP_INT_ENA_M  (RMT_CH0_TX_LOOP_INT_ENA_V << RMT_CH0_TX_LOOP_INT_ENA_S)
#define RMT_CH0_TX_LOOP_INT_ENA_V  0x00000001
#define RMT_CH0_TX_LOOP_INT_ENA_S  12
/** RMT_CH1_TX_LOOP_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The interrupt enable bit for CH1_TX_LOOP_INT.
 */
#define RMT_CH1_TX_LOOP_INT_ENA    (BIT(13))
#define RMT_CH1_TX_LOOP_INT_ENA_M  (RMT_CH1_TX_LOOP_INT_ENA_V << RMT_CH1_TX_LOOP_INT_ENA_S)
#define RMT_CH1_TX_LOOP_INT_ENA_V  0x00000001
#define RMT_CH1_TX_LOOP_INT_ENA_S  13
/** RMT_CH2_TX_LOOP_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  The interrupt enable bit for CH2_TX_LOOP_INT.
 */
#define RMT_CH2_TX_LOOP_INT_ENA    (BIT(14))
#define RMT_CH2_TX_LOOP_INT_ENA_M  (RMT_CH2_TX_LOOP_INT_ENA_V << RMT_CH2_TX_LOOP_INT_ENA_S)
#define RMT_CH2_TX_LOOP_INT_ENA_V  0x00000001
#define RMT_CH2_TX_LOOP_INT_ENA_S  14
/** RMT_CH3_TX_LOOP_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  The interrupt enable bit for CH3_TX_LOOP_INT.
 */
#define RMT_CH3_TX_LOOP_INT_ENA    (BIT(15))
#define RMT_CH3_TX_LOOP_INT_ENA_M  (RMT_CH3_TX_LOOP_INT_ENA_V << RMT_CH3_TX_LOOP_INT_ENA_S)
#define RMT_CH3_TX_LOOP_INT_ENA_V  0x00000001
#define RMT_CH3_TX_LOOP_INT_ENA_S  15
/** RMT_CH4_RX_END_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  The interrupt enable bit for CH4_RX_END_INT.
 */
#define RMT_CH4_RX_END_INT_ENA    (BIT(16))
#define RMT_CH4_RX_END_INT_ENA_M  (RMT_CH4_RX_END_INT_ENA_V << RMT_CH4_RX_END_INT_ENA_S)
#define RMT_CH4_RX_END_INT_ENA_V  0x00000001
#define RMT_CH4_RX_END_INT_ENA_S  16
/** RMT_CH5_RX_END_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  The interrupt enable bit for CH5_RX_END_INT.
 */
#define RMT_CH5_RX_END_INT_ENA    (BIT(17))
#define RMT_CH5_RX_END_INT_ENA_M  (RMT_CH5_RX_END_INT_ENA_V << RMT_CH5_RX_END_INT_ENA_S)
#define RMT_CH5_RX_END_INT_ENA_V  0x00000001
#define RMT_CH5_RX_END_INT_ENA_S  17
/** RMT_CH6_RX_END_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  The interrupt enable bit for CH6_RX_END_INT.
 */
#define RMT_CH6_RX_END_INT_ENA    (BIT(18))
#define RMT_CH6_RX_END_INT_ENA_M  (RMT_CH6_RX_END_INT_ENA_V << RMT_CH6_RX_END_INT_ENA_S)
#define RMT_CH6_RX_END_INT_ENA_V  0x00000001
#define RMT_CH6_RX_END_INT_ENA_S  18
/** RMT_CH7_RX_END_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  The interrupt enable bit for CH7_RX_END_INT.
 */
#define RMT_CH7_RX_END_INT_ENA    (BIT(19))
#define RMT_CH7_RX_END_INT_ENA_M  (RMT_CH7_RX_END_INT_ENA_V << RMT_CH7_RX_END_INT_ENA_S)
#define RMT_CH7_RX_END_INT_ENA_V  0x00000001
#define RMT_CH7_RX_END_INT_ENA_S  19
/** RMT_CH4_ERR_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  The interrupt enable bit for CH4_ERR_INT.
 */
#define RMT_CH4_ERR_INT_ENA    (BIT(20))
#define RMT_CH4_ERR_INT_ENA_M  (RMT_CH4_ERR_INT_ENA_V << RMT_CH4_ERR_INT_ENA_S)
#define RMT_CH4_ERR_INT_ENA_V  0x00000001
#define RMT_CH4_ERR_INT_ENA_S  20
/** RMT_CH5_ERR_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  The interrupt enable bit for CH5_ERR_INT.
 */
#define RMT_CH5_ERR_INT_ENA    (BIT(21))
#define RMT_CH5_ERR_INT_ENA_M  (RMT_CH5_ERR_INT_ENA_V << RMT_CH5_ERR_INT_ENA_S)
#define RMT_CH5_ERR_INT_ENA_V  0x00000001
#define RMT_CH5_ERR_INT_ENA_S  21
/** RMT_CH6_ERR_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  The interrupt enable bit for CH6_ERR_INT.
 */
#define RMT_CH6_ERR_INT_ENA    (BIT(22))
#define RMT_CH6_ERR_INT_ENA_M  (RMT_CH6_ERR_INT_ENA_V << RMT_CH6_ERR_INT_ENA_S)
#define RMT_CH6_ERR_INT_ENA_V  0x00000001
#define RMT_CH6_ERR_INT_ENA_S  22
/** RMT_CH7_ERR_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  The interrupt enable bit for CH7_ERR_INT.
 */
#define RMT_CH7_ERR_INT_ENA    (BIT(23))
#define RMT_CH7_ERR_INT_ENA_M  (RMT_CH7_ERR_INT_ENA_V << RMT_CH7_ERR_INT_ENA_S)
#define RMT_CH7_ERR_INT_ENA_V  0x00000001
#define RMT_CH7_ERR_INT_ENA_S  23
/** RMT_CH4_RX_THR_EVENT_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  The interrupt enable bit for CH4_RX_THR_EVENT_INT.
 */
#define RMT_CH4_RX_THR_EVENT_INT_ENA    (BIT(24))
#define RMT_CH4_RX_THR_EVENT_INT_ENA_M  (RMT_CH4_RX_THR_EVENT_INT_ENA_V << RMT_CH4_RX_THR_EVENT_INT_ENA_S)
#define RMT_CH4_RX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH4_RX_THR_EVENT_INT_ENA_S  24
/** RMT_CH5_RX_THR_EVENT_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  The interrupt enable bit for CH5_RX_THR_EVENT_INT.
 */
#define RMT_CH5_RX_THR_EVENT_INT_ENA    (BIT(25))
#define RMT_CH5_RX_THR_EVENT_INT_ENA_M  (RMT_CH5_RX_THR_EVENT_INT_ENA_V << RMT_CH5_RX_THR_EVENT_INT_ENA_S)
#define RMT_CH5_RX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH5_RX_THR_EVENT_INT_ENA_S  25
/** RMT_CH6_RX_THR_EVENT_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  The interrupt enable bit for CH6_RX_THR_EVENT_INT.
 */
#define RMT_CH6_RX_THR_EVENT_INT_ENA    (BIT(26))
#define RMT_CH6_RX_THR_EVENT_INT_ENA_M  (RMT_CH6_RX_THR_EVENT_INT_ENA_V << RMT_CH6_RX_THR_EVENT_INT_ENA_S)
#define RMT_CH6_RX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH6_RX_THR_EVENT_INT_ENA_S  26
/** RMT_CH7_RX_THR_EVENT_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  The interrupt enable bit for CH7_RX_THR_EVENT_INT.
 */
#define RMT_CH7_RX_THR_EVENT_INT_ENA    (BIT(27))
#define RMT_CH7_RX_THR_EVENT_INT_ENA_M  (RMT_CH7_RX_THR_EVENT_INT_ENA_V << RMT_CH7_RX_THR_EVENT_INT_ENA_S)
#define RMT_CH7_RX_THR_EVENT_INT_ENA_V  0x00000001
#define RMT_CH7_RX_THR_EVENT_INT_ENA_S  27

/** RMT_INT_CLR_REG register
 *  Interrupt clear bits
 */
#define RMT_INT_CLR_REG (DR_REG_RMT_BASE + 0x7c)
/** RMT_CH0_TX_END_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear theCH0_TX_END_INT interrupt.
 */
#define RMT_CH0_TX_END_INT_CLR    (BIT(0))
#define RMT_CH0_TX_END_INT_CLR_M  (RMT_CH0_TX_END_INT_CLR_V << RMT_CH0_TX_END_INT_CLR_S)
#define RMT_CH0_TX_END_INT_CLR_V  0x00000001
#define RMT_CH0_TX_END_INT_CLR_S  0
/** RMT_CH1_TX_END_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear theCH1_TX_END_INT interrupt.
 */
#define RMT_CH1_TX_END_INT_CLR    (BIT(1))
#define RMT_CH1_TX_END_INT_CLR_M  (RMT_CH1_TX_END_INT_CLR_V << RMT_CH1_TX_END_INT_CLR_S)
#define RMT_CH1_TX_END_INT_CLR_V  0x00000001
#define RMT_CH1_TX_END_INT_CLR_S  1
/** RMT_CH2_TX_END_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear theCH2_TX_END_INT interrupt.
 */
#define RMT_CH2_TX_END_INT_CLR    (BIT(2))
#define RMT_CH2_TX_END_INT_CLR_M  (RMT_CH2_TX_END_INT_CLR_V << RMT_CH2_TX_END_INT_CLR_S)
#define RMT_CH2_TX_END_INT_CLR_V  0x00000001
#define RMT_CH2_TX_END_INT_CLR_S  2
/** RMT_CH3_TX_END_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear theCH3_TX_END_INT interrupt.
 */
#define RMT_CH3_TX_END_INT_CLR    (BIT(3))
#define RMT_CH3_TX_END_INT_CLR_M  (RMT_CH3_TX_END_INT_CLR_V << RMT_CH3_TX_END_INT_CLR_S)
#define RMT_CH3_TX_END_INT_CLR_V  0x00000001
#define RMT_CH3_TX_END_INT_CLR_S  3
/** RMT_CH0_ERR_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear theCH0_ERR_INT interrupt.
 */
#define RMT_CH0_ERR_INT_CLR    (BIT(4))
#define RMT_CH0_ERR_INT_CLR_M  (RMT_CH0_ERR_INT_CLR_V << RMT_CH0_ERR_INT_CLR_S)
#define RMT_CH0_ERR_INT_CLR_V  0x00000001
#define RMT_CH0_ERR_INT_CLR_S  4
/** RMT_CH1_ERR_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear theCH1_ERR_INT interrupt.
 */
#define RMT_CH1_ERR_INT_CLR    (BIT(5))
#define RMT_CH1_ERR_INT_CLR_M  (RMT_CH1_ERR_INT_CLR_V << RMT_CH1_ERR_INT_CLR_S)
#define RMT_CH1_ERR_INT_CLR_V  0x00000001
#define RMT_CH1_ERR_INT_CLR_S  5
/** RMT_CH2_ERR_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear theCH2_ERR_INT interrupt.
 */
#define RMT_CH2_ERR_INT_CLR    (BIT(6))
#define RMT_CH2_ERR_INT_CLR_M  (RMT_CH2_ERR_INT_CLR_V << RMT_CH2_ERR_INT_CLR_S)
#define RMT_CH2_ERR_INT_CLR_V  0x00000001
#define RMT_CH2_ERR_INT_CLR_S  6
/** RMT_CH3_ERR_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear theCH3_ERR_INT interrupt.
 */
#define RMT_CH3_ERR_INT_CLR    (BIT(7))
#define RMT_CH3_ERR_INT_CLR_M  (RMT_CH3_ERR_INT_CLR_V << RMT_CH3_ERR_INT_CLR_S)
#define RMT_CH3_ERR_INT_CLR_V  0x00000001
#define RMT_CH3_ERR_INT_CLR_S  7
/** RMT_CH0_TX_THR_EVENT_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear theCH0_TX_THR_EVENT_INT interrupt.
 */
#define RMT_CH0_TX_THR_EVENT_INT_CLR    (BIT(8))
#define RMT_CH0_TX_THR_EVENT_INT_CLR_M  (RMT_CH0_TX_THR_EVENT_INT_CLR_V << RMT_CH0_TX_THR_EVENT_INT_CLR_S)
#define RMT_CH0_TX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH0_TX_THR_EVENT_INT_CLR_S  8
/** RMT_CH1_TX_THR_EVENT_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear theCH1_TX_THR_EVENT_INT interrupt.
 */
#define RMT_CH1_TX_THR_EVENT_INT_CLR    (BIT(9))
#define RMT_CH1_TX_THR_EVENT_INT_CLR_M  (RMT_CH1_TX_THR_EVENT_INT_CLR_V << RMT_CH1_TX_THR_EVENT_INT_CLR_S)
#define RMT_CH1_TX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH1_TX_THR_EVENT_INT_CLR_S  9
/** RMT_CH2_TX_THR_EVENT_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear theCH2_TX_THR_EVENT_INT interrupt.
 */
#define RMT_CH2_TX_THR_EVENT_INT_CLR    (BIT(10))
#define RMT_CH2_TX_THR_EVENT_INT_CLR_M  (RMT_CH2_TX_THR_EVENT_INT_CLR_V << RMT_CH2_TX_THR_EVENT_INT_CLR_S)
#define RMT_CH2_TX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH2_TX_THR_EVENT_INT_CLR_S  10
/** RMT_CH3_TX_THR_EVENT_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear theCH3_TX_THR_EVENT_INT interrupt.
 */
#define RMT_CH3_TX_THR_EVENT_INT_CLR    (BIT(11))
#define RMT_CH3_TX_THR_EVENT_INT_CLR_M  (RMT_CH3_TX_THR_EVENT_INT_CLR_V << RMT_CH3_TX_THR_EVENT_INT_CLR_S)
#define RMT_CH3_TX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH3_TX_THR_EVENT_INT_CLR_S  11
/** RMT_CH0_TX_LOOP_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear theCH0_TX_LOOP_INT interrupt.
 */
#define RMT_CH0_TX_LOOP_INT_CLR    (BIT(12))
#define RMT_CH0_TX_LOOP_INT_CLR_M  (RMT_CH0_TX_LOOP_INT_CLR_V << RMT_CH0_TX_LOOP_INT_CLR_S)
#define RMT_CH0_TX_LOOP_INT_CLR_V  0x00000001
#define RMT_CH0_TX_LOOP_INT_CLR_S  12
/** RMT_CH1_TX_LOOP_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Set this bit to clear theCH1_TX_LOOP_INT interrupt.
 */
#define RMT_CH1_TX_LOOP_INT_CLR    (BIT(13))
#define RMT_CH1_TX_LOOP_INT_CLR_M  (RMT_CH1_TX_LOOP_INT_CLR_V << RMT_CH1_TX_LOOP_INT_CLR_S)
#define RMT_CH1_TX_LOOP_INT_CLR_V  0x00000001
#define RMT_CH1_TX_LOOP_INT_CLR_S  13
/** RMT_CH2_TX_LOOP_INT_CLR : WT; bitpos: [14]; default: 0;
 *  Set this bit to clear theCH2_TX_LOOP_INT interrupt.
 */
#define RMT_CH2_TX_LOOP_INT_CLR    (BIT(14))
#define RMT_CH2_TX_LOOP_INT_CLR_M  (RMT_CH2_TX_LOOP_INT_CLR_V << RMT_CH2_TX_LOOP_INT_CLR_S)
#define RMT_CH2_TX_LOOP_INT_CLR_V  0x00000001
#define RMT_CH2_TX_LOOP_INT_CLR_S  14
/** RMT_CH3_TX_LOOP_INT_CLR : WT; bitpos: [15]; default: 0;
 *  Set this bit to clear theCH3_TX_LOOP_INT interrupt.
 */
#define RMT_CH3_TX_LOOP_INT_CLR    (BIT(15))
#define RMT_CH3_TX_LOOP_INT_CLR_M  (RMT_CH3_TX_LOOP_INT_CLR_V << RMT_CH3_TX_LOOP_INT_CLR_S)
#define RMT_CH3_TX_LOOP_INT_CLR_V  0x00000001
#define RMT_CH3_TX_LOOP_INT_CLR_S  15
/** RMT_CH4_RX_END_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Set this bit to clear theCH4_RX_END_INT interrupt.
 */
#define RMT_CH4_RX_END_INT_CLR    (BIT(16))
#define RMT_CH4_RX_END_INT_CLR_M  (RMT_CH4_RX_END_INT_CLR_V << RMT_CH4_RX_END_INT_CLR_S)
#define RMT_CH4_RX_END_INT_CLR_V  0x00000001
#define RMT_CH4_RX_END_INT_CLR_S  16
/** RMT_CH5_RX_END_INT_CLR : WT; bitpos: [17]; default: 0;
 *  Set this bit to clear theCH5_RX_END_INT interrupt.
 */
#define RMT_CH5_RX_END_INT_CLR    (BIT(17))
#define RMT_CH5_RX_END_INT_CLR_M  (RMT_CH5_RX_END_INT_CLR_V << RMT_CH5_RX_END_INT_CLR_S)
#define RMT_CH5_RX_END_INT_CLR_V  0x00000001
#define RMT_CH5_RX_END_INT_CLR_S  17
/** RMT_CH6_RX_END_INT_CLR : WT; bitpos: [18]; default: 0;
 *  Set this bit to clear theCH6_RX_END_INT interrupt.
 */
#define RMT_CH6_RX_END_INT_CLR    (BIT(18))
#define RMT_CH6_RX_END_INT_CLR_M  (RMT_CH6_RX_END_INT_CLR_V << RMT_CH6_RX_END_INT_CLR_S)
#define RMT_CH6_RX_END_INT_CLR_V  0x00000001
#define RMT_CH6_RX_END_INT_CLR_S  18
/** RMT_CH7_RX_END_INT_CLR : WT; bitpos: [19]; default: 0;
 *  Set this bit to clear theCH7_RX_END_INT interrupt.
 */
#define RMT_CH7_RX_END_INT_CLR    (BIT(19))
#define RMT_CH7_RX_END_INT_CLR_M  (RMT_CH7_RX_END_INT_CLR_V << RMT_CH7_RX_END_INT_CLR_S)
#define RMT_CH7_RX_END_INT_CLR_V  0x00000001
#define RMT_CH7_RX_END_INT_CLR_S  19
/** RMT_CH4_ERR_INT_CLR : WT; bitpos: [20]; default: 0;
 *  Set this bit to clear theCH4_ERR_INT interrupt.
 */
#define RMT_CH4_ERR_INT_CLR    (BIT(20))
#define RMT_CH4_ERR_INT_CLR_M  (RMT_CH4_ERR_INT_CLR_V << RMT_CH4_ERR_INT_CLR_S)
#define RMT_CH4_ERR_INT_CLR_V  0x00000001
#define RMT_CH4_ERR_INT_CLR_S  20
/** RMT_CH5_ERR_INT_CLR : WT; bitpos: [21]; default: 0;
 *  Set this bit to clear theCH5_ERR_INT interrupt.
 */
#define RMT_CH5_ERR_INT_CLR    (BIT(21))
#define RMT_CH5_ERR_INT_CLR_M  (RMT_CH5_ERR_INT_CLR_V << RMT_CH5_ERR_INT_CLR_S)
#define RMT_CH5_ERR_INT_CLR_V  0x00000001
#define RMT_CH5_ERR_INT_CLR_S  21
/** RMT_CH6_ERR_INT_CLR : WT; bitpos: [22]; default: 0;
 *  Set this bit to clear theCH6_ERR_INT interrupt.
 */
#define RMT_CH6_ERR_INT_CLR    (BIT(22))
#define RMT_CH6_ERR_INT_CLR_M  (RMT_CH6_ERR_INT_CLR_V << RMT_CH6_ERR_INT_CLR_S)
#define RMT_CH6_ERR_INT_CLR_V  0x00000001
#define RMT_CH6_ERR_INT_CLR_S  22
/** RMT_CH7_ERR_INT_CLR : WT; bitpos: [23]; default: 0;
 *  Set this bit to clear theCH7_ERR_INT interrupt.
 */
#define RMT_CH7_ERR_INT_CLR    (BIT(23))
#define RMT_CH7_ERR_INT_CLR_M  (RMT_CH7_ERR_INT_CLR_V << RMT_CH7_ERR_INT_CLR_S)
#define RMT_CH7_ERR_INT_CLR_V  0x00000001
#define RMT_CH7_ERR_INT_CLR_S  23
/** RMT_CH4_RX_THR_EVENT_INT_CLR : WT; bitpos: [24]; default: 0;
 *  Set this bit to clear theCH4_RX_THR_EVENT_INT interrupt.
 */
#define RMT_CH4_RX_THR_EVENT_INT_CLR    (BIT(24))
#define RMT_CH4_RX_THR_EVENT_INT_CLR_M  (RMT_CH4_RX_THR_EVENT_INT_CLR_V << RMT_CH4_RX_THR_EVENT_INT_CLR_S)
#define RMT_CH4_RX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH4_RX_THR_EVENT_INT_CLR_S  24
/** RMT_CH5_RX_THR_EVENT_INT_CLR : WT; bitpos: [25]; default: 0;
 *  Set this bit to clear theCH5_RX_THR_EVENT_INT interrupt.
 */
#define RMT_CH5_RX_THR_EVENT_INT_CLR    (BIT(25))
#define RMT_CH5_RX_THR_EVENT_INT_CLR_M  (RMT_CH5_RX_THR_EVENT_INT_CLR_V << RMT_CH5_RX_THR_EVENT_INT_CLR_S)
#define RMT_CH5_RX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH5_RX_THR_EVENT_INT_CLR_S  25
/** RMT_CH6_RX_THR_EVENT_INT_CLR : WT; bitpos: [26]; default: 0;
 *  Set this bit to clear theCH6_RX_THR_EVENT_INT interrupt.
 */
#define RMT_CH6_RX_THR_EVENT_INT_CLR    (BIT(26))
#define RMT_CH6_RX_THR_EVENT_INT_CLR_M  (RMT_CH6_RX_THR_EVENT_INT_CLR_V << RMT_CH6_RX_THR_EVENT_INT_CLR_S)
#define RMT_CH6_RX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH6_RX_THR_EVENT_INT_CLR_S  26
/** RMT_CH7_RX_THR_EVENT_INT_CLR : WT; bitpos: [27]; default: 0;
 *  Set this bit to clear theCH7_RX_THR_EVENT_INT interrupt.
 */
#define RMT_CH7_RX_THR_EVENT_INT_CLR    (BIT(27))
#define RMT_CH7_RX_THR_EVENT_INT_CLR_M  (RMT_CH7_RX_THR_EVENT_INT_CLR_V << RMT_CH7_RX_THR_EVENT_INT_CLR_S)
#define RMT_CH7_RX_THR_EVENT_INT_CLR_V  0x00000001
#define RMT_CH7_RX_THR_EVENT_INT_CLR_S  27

/** RMT_CH0CARRIER_DUTY_REG register
 *  Channel 0 duty cycle configuration register
 */
#define RMT_CH0CARRIER_DUTY_REG (DR_REG_RMT_BASE + 0x80)
/** RMT_CARRIER_LOW_CH0 : R/W; bitpos: [15:0]; default: 64;
 *  This register is used to configure carrier wave 's low level clock period for
 *  CHANNEL0.
 */
#define RMT_CARRIER_LOW_CH0    0x0000FFFF
#define RMT_CARRIER_LOW_CH0_M  (RMT_CARRIER_LOW_CH0_V << RMT_CARRIER_LOW_CH0_S)
#define RMT_CARRIER_LOW_CH0_V  0x0000FFFF
#define RMT_CARRIER_LOW_CH0_S  0
/** RMT_CARRIER_HIGH_CH0 : R/W; bitpos: [31:16]; default: 64;
 *  This register is used to configure carrier wave 's high level clock period for
 *  CHANNEL0.
 */
#define RMT_CARRIER_HIGH_CH0    0x0000FFFF
#define RMT_CARRIER_HIGH_CH0_M  (RMT_CARRIER_HIGH_CH0_V << RMT_CARRIER_HIGH_CH0_S)
#define RMT_CARRIER_HIGH_CH0_V  0x0000FFFF
#define RMT_CARRIER_HIGH_CH0_S  16

