espressif/esp-idf/components/soc/soc/esp32s3/include/soc/rmt_reg.h
/** RMT_REF_CNT_RST_REG register
 *  RMT clock divider reset register
 */
#define RMT_REF_CNT_RST_REG (DR_REG_RMT_BASE + 0xc8)
/** RMT_REF_CNT_RST_CH0 : WT; bitpos: [0]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL0.
 */
#define RMT_REF_CNT_RST_CH0    (BIT(0))
#define RMT_REF_CNT_RST_CH0_M  (RMT_REF_CNT_RST_CH0_V << RMT_REF_CNT_RST_CH0_S)
#define RMT_REF_CNT_RST_CH0_V  0x00000001
#define RMT_REF_CNT_RST_CH0_S  0
/** RMT_REF_CNT_RST_CH1 : WT; bitpos: [1]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL1.
 */
#define RMT_REF_CNT_RST_CH1    (BIT(1))
#define RMT_REF_CNT_RST_CH1_M  (RMT_REF_CNT_RST_CH1_V << RMT_REF_CNT_RST_CH1_S)
#define RMT_REF_CNT_RST_CH1_V  0x00000001
#define RMT_REF_CNT_RST_CH1_S  1
/** RMT_REF_CNT_RST_CH2 : WT; bitpos: [2]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL2.
 */
#define RMT_REF_CNT_RST_CH2    (BIT(2))
#define RMT_REF_CNT_RST_CH2_M  (RMT_REF_CNT_RST_CH2_V << RMT_REF_CNT_RST_CH2_S)
#define RMT_REF_CNT_RST_CH2_V  0x00000001
#define RMT_REF_CNT_RST_CH2_S  2
/** RMT_REF_CNT_RST_CH3 : WT; bitpos: [3]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL3.
 */
#define RMT_REF_CNT_RST_CH3    (BIT(3))
#define RMT_REF_CNT_RST_CH3_M  (RMT_REF_CNT_RST_CH3_V << RMT_REF_CNT_RST_CH3_S)
#define RMT_REF_CNT_RST_CH3_V  0x00000001
#define RMT_REF_CNT_RST_CH3_S  3
/** RMT_REF_CNT_RST_CH4 : WT; bitpos: [4]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL4.
 */
#define RMT_REF_CNT_RST_CH4    (BIT(4))
#define RMT_REF_CNT_RST_CH4_M  (RMT_REF_CNT_RST_CH4_V << RMT_REF_CNT_RST_CH4_S)
#define RMT_REF_CNT_RST_CH4_V  0x00000001
#define RMT_REF_CNT_RST_CH4_S  4
/** RMT_REF_CNT_RST_CH5 : WT; bitpos: [5]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL5.
 */
#define RMT_REF_CNT_RST_CH5    (BIT(5))
#define RMT_REF_CNT_RST_CH5_M  (RMT_REF_CNT_RST_CH5_V << RMT_REF_CNT_RST_CH5_S)
#define RMT_REF_CNT_RST_CH5_V  0x00000001
#define RMT_REF_CNT_RST_CH5_S  5
/** RMT_REF_CNT_RST_CH6 : WT; bitpos: [6]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL6.
 */
#define RMT_REF_CNT_RST_CH6    (BIT(6))
#define RMT_REF_CNT_RST_CH6_M  (RMT_REF_CNT_RST_CH6_V << RMT_REF_CNT_RST_CH6_S)
#define RMT_REF_CNT_RST_CH6_V  0x00000001
#define RMT_REF_CNT_RST_CH6_S  6
/** RMT_REF_CNT_RST_CH7 : WT; bitpos: [7]; default: 0;
 *  This register is used to reset the clock divider of CHANNEL7.
 */
#define RMT_REF_CNT_RST_CH7    (BIT(7))
#define RMT_REF_CNT_RST_CH7_M  (RMT_REF_CNT_RST_CH7_V << RMT_REF_CNT_RST_CH7_S)
#define RMT_REF_CNT_RST_CH7_V  0x00000001
#define RMT_REF_CNT_RST_CH7_S  7

/** RMT_DATE_REG register
 *  RMT version register
 */
#define RMT_DATE_REG (DR_REG_RMT_BASE + 0xcc)
/** RMT_DATE : R/W; bitpos: [27:0]; default: 33566785;
 *  This is the version register.
 */
#define RMT_DATE    0x0FFFFFFF
#define RMT_DATE_M  (RMT_DATE_V << RMT_DATE_S)
#define RMT_DATE_V  0x0FFFFFFF
#define RMT_DATE_S  0

#ifdef __cplusplus
}
#endif
